[
    {
        "id":1,
        "Tittle":"Classic Tales from India",
        "img":"/images/tales.jpg",
        "Price":"12$",
        "Detail":"Seven beautifully illustrated traditional stories that immerse the reader in the ancient culture of India as well as impart important life lessons  Shares classic tales from India, including stories drawn from the Mahabharata, the Ramayana, and the Puranas, translated by the author "
        },
        {
            "id":2,
            "Tittle":"rice painting",
            "img":"/images/tranh-gao.jpg",
            "Price":"12$",
            "Detail":"paintings are made from rice. create physical harmony artistic patterns will be an extremely unique souvenir from Vietnam"
        },
        {
            "id":3,
            "Tittle":"Vietnamese Ao Dai Doll",
            "img":"/images/bupbe.jpg",
            "Price":"100$",
            "Detail":"The Vietnamese ao dai is an inseparable cultural feature of the Vietnamese people. A Vietnamese girl doll in an ao dai with unique and artistic patterns will be an extremely unique souvenir from Vietnam."
        },
       
        {
            "id":4,
            "Tittle":"The Heart of the Buddha's Teaching",
            "img":"/images/boo.jpg",
            "Price":"20$",
            "Detail":"With poetry and clarity, Thich Nhat Hanh imparts comforting wisdom about the nature of suffering and its role in creating compassion, love, and joy – all qualities of enlightenment.With poetry and clarity, Thich Nhat Hanh imparts comforting wisdom about the nature of suffering and its role in creating compassion, love, and joy – all qualities of enlightenment."
        },
        {
            "id":5,
            "Tittle":"SEA BLUE APATITE BRACELET",
            "img":"/images/blue.jpg",
            "Price":"1000$",
            "Detail":"Apatite is considered a precious stone used in jewelry making. They can be found in nature in yellow, blue, green, gray or colorless,Apatite is known as the “Stone of Ambition” because it promotes personal progress to achieve important goals. It simultaneously enhances creativity and stimulates the development of internal self-factors"
        },
    
        {
            "id":6,
            "Tittle":"APATITE BRACELET",
            "img":"/images/vong.jpg",
            "Price":"1000$",
            "Detail":"Apatite is considered a precious stone used in jewelry making. They can be found in nature in yellow, blue, green, gray or colorless,Apatite is known as the “Stone of Ambition” because it promotes personal progress to achieve important goals. It simultaneously enhances creativity and stimulates the development of internal self-factors"
        },
        {
            "id":7,
            "Tittle":"Shakyamuni Buddha painting",
            "img":"/images/tranhjpg.jpg",
            "Price":"200$",
            "Detail":" Helps you bring a strangely beautiful style! Gifts for foreign guests"
        },
    
       
        {
            "id":8,
            "Tittle":"quả cầu với cây thông noel",
            "img":"/images/noel.jpg",
            "Price":"5$",
            "Detail":"Souvenir crystal ball with snowy, spruce Christmas tree inside. Realistic sphere falling snowflakes, glass sphere isolated on white background. Shake toy for a winter treat or gift"
        },
       
        {
            "id":9,
            "Tittle":"Nón Lá",
            "img":"/images/nonla.jpg",
            "Price":"10$",
            "Detail":"Nón lá or nón tơi is a type of Vietnamese headwear used to shield the face from the sun and rain. Nón lá is a typical symbol of the Vietnamese people. Nón lá is a common name for many types of hats in Vietnam, but now it is mainly used to refer to cones with pointed tips."
        },
        {
            "id":10,
            "Tittle":"grass handbags",
            "img":"/images/tuixach.jpg",
            "Price":"200$",
            "Detail":"Fashion trends associated with nature are becoming more and more popular in modern society. You cannot lack a cute sedge bag with soft strokes, enhancing the gentle and elegant beauty. Helps you bring a strangely beautiful style! Gifts for foreign guests"
        },
        {
            "id":11,
            "Tittle":"Indian Scarves",
            "img":"/images/indian.jpg",
            "Price":"20$",
            "Detail":"A fairly-traded, soft Indian striped scarf to match our Bedouin Beaded Bags"
        },
        {
            "id":22,
            "Tittle":"bracelet",
            "img":"/images/vong-tay.jpg",
            "Price":"10$",
            "Detail":"All are Swarovski crystal 001AB, consisting of 10 round beads 8ly 5000 black jet 280 or 001AB, 10 cones 6ly 5328, 1 cross 5378 and silver buckle 925.default size 17cm."
        }
]