
[
    {
        "id": 1,
        "title":"Diwali Festival",
        "img":"/images/Dehi.jpg",
        "DM":" Hindu festival of lights with its variations also celebrated in other Indian religions. It symbolises the spiritual victory of light over darkness, good over evil, and ...",
        "Detail":
            {   
                "id":2,
                "time":"The five-day celebration is observed every year in early autumn after the conclusion of the summer harvest. It coincides with the new moon (amāvasyā) and is deemed the darkest night of the Hindu lunisolar calendar.[45] The festivities begin two days before amāvasyā, on Dhanteras, and extend two days after, until the second (or 17th) day of the month of Kartik",
                "DS":"Diwali; Deepavali  or Divali; is the Hindu festival of lights with its variations also celebrated in other Indian religions. It symbolises the spiritual victory of light over darkness, good over evil, and knowledge over ignorance. Diwali is celebrated during the Hindu lunisolar months of Ashvin (according to the amanta tradition) and Kartika—between around mid-September and mid-November.[8][9][10][11] The celebrations generally last five or six days Diwali is connected to various religious events, deities and personalities, such as being the day Rama returned to his kingdom in Ayodhya with his wife Sita and his brother Lakshmana after defeating the demon king Ravana.[14] It is also widely associated with Lakshmi, the goddess of prosperity and Ganesha, the god of wisdom and the remover of obstacles.[15] Other regional traditions connect the holiday to Vishnu, Krishna, Durga, Shiva, Kali, Hanuman, Kubera, Yama, Yami, Dhanvantari, or Vishvakarman.Primarily a Hindu festival, variations of Diwali are also celebrated by adherents of other faiths.[12] The Jains observe their own Diwali which marks the final liberation of Mahavira,[16][17] the Sikhs celebrate Bandi Chhor Divas to mark the release of Guru Hargobind from a Mughal prison.[18] Newar Buddhists, unlike other Buddhists, celebrate Diwali by worshipping Lakshmi, while the Hindus of Eastern India and Bangladesh generally celebrate Diwali by worshipping the goddess Kali.During the festival, the celebrants illuminate their homes, temples and workspaces with diyas (oil lamps), candles and lanterns.[7] Hindus, in particular, have a ritual oil bath at dawn on each day of the festival.[22] Diwali is also marked with fireworks and the decoration of floors with rangoli designs, and other parts of the house with jhalars. Food is a major focus with families partaking in feasts and sharing mithai.[23] The festival is an annual homecoming and bonding period not only for families,[14][15] but also for communities and associations, particularly those in urban areas, which will organise activities, events and gatherings.[24][25] Many towns organise community parades and fairs with parades or music and dance performances in parks.[26] Some Hindus, Jains and Sikhs will send Diwali greeting cards to family near and far during the festive season, occasionally with boxes of Indian confectionery.[26] Another aspect of the festival is remembering the ancestors.[27]Diwali is also a major cultural event for the Hindu, Sikh, and Jain diaspora.[28][29][30] The main day of the festival of Diwali (the day of Lakshmi Puja) is an official holiday in Fiji,[31] Guyana,[32] India, Malaysia,[b][33] Mauritius, Myanmar,[34] Nepal,[35] Pakistan,[36] Singapore,[37] Sri Lanka, Suriname, and Trinidad and Tobago.[38]",
                "HIS":"The five-day long festival originated in the Indian subcontinent and is likely a fusion of harvest festivals in ancient India.[47] It is mentioned in early Sanskrit texts, such as the Padma Purana and the Skanda Purana, both of which were completed in the second half of the 1st millennium CE. The diyas (lamps) are mentioned in Skanda Kishore Purana as symbolising parts of the sun, describing it as the cosmic giver of light and energy to all life and which seasonally transitions in the Hindu calendar month of Kartik.Emperor Harsha refers to Deepavali, in the 7th-century Sanskrit play Nagananda, as Dīpapratipadotsava (dīpa = light, pratipadā = first day, utsava = festival), where lamps were lit and newly engaged brides and grooms received gifts.[53][54] Rajasekhara referred to Deepavali as Dipamalika in his 9th-century Kavyamimamsa, wherein he mentions the tradition of homes being whitewashed and oil lamps decorated homes, streets and markets in the nightDiwali was also described by numerous travelers from outside India. In his 11th-century memoir on India, the Persian traveler and historian Al Biruni wrote of Deepavali being celebrated by Hindus on the day of the New Moon in the month of Kartika.[55] The Venetian merchant and traveler Niccolò de' Conti visited India in the early 15th-century and wrote in his memoir, on another of these festivals they fix up within their temples, and on the outside of the roofs, an innumerable number of oil lamps... which are kept burning day and night and that the families would gather, clothe themselves in new garments, sing, dance and feast.[56][57] The 16th-century Portuguese traveler Domingo Paes wrote of his visit to the Hindu Vijayanagara Empire, where Dipavali was celebrated in October with householders illuminating their homes, and their temples, with lamps.[57] It is mentioned in the Ramayana that Diwali was celebrated for only 2 years in Ayodhya.[58]"
            }
    },
    {
        "id": 2,
        "title":"The Holi festival",
        "img":"/images/holi.jpg",
        "DM":"Holi is a popular and significant Hindu festival celebrated as the Festival of Colours, Love and Spring.It celebrates the eternal and divine love of ...",
        "Page":
            {  
                "id":2 
            },
        "Detail":
            {   
                "id":2,
                "time":"Holi 2024:Monday, March 25",
                "DS":"Holi is a sacred ancient tradition of Hindus, a holiday in many states of India and Nepal with regional holidays in other countries. To many Hindus and some non-Hindus, it is a playful cultural event and an excuse to throw coloured water at friends or strangers in jest. It is also observed broadly in the Indian subcontinent. Holi is celebrated at the end of winter, on the last full moon day of the Hindu luni-solar calendar month marking the spring, making the date vary with the lunar cycle.[note 1] The date falls typically in March, but sometimes late February of the Gregorian calendar,The festival has many purposes; most prominently, it celebrates the beginning of Spring. In 17th century literature, it was identified as a festival that celebrated agriculture, commemorated good spring harvests and the fertile land.[18] Hindus believe it is a time of enjoying spring's abundant colours and saying farewell to winter. To many Hindus, Holi festivities mark an occasion to reset and renew ruptured relationships, end conflicts and rid themselves of accumulated emotional impurities from the past.It also has a religious purpose, symbolically signified by the legend of Holika. The night before Holi, bonfires are lit in a ceremony known as Holika Dahan (burning of Holika) or Little Holi People gather near fires, sing and dance. The next day, Holi, also known as Dhuli in Sanskrit, or Dhulheti, Dhulandi or Dhulendi, is celebrated.In Northern parts of India, children and youth spray coloured powder solutions (gulal) at each other, laugh and celebrate, while adults smear dry coloured powder (abir) on each other's faces.[5][35] Visitors to homes are first teased with colours, then served with Holi delicacies (such as puranpoli, dahi-bada and gujia), desserts and drinks.[37][38][39] After playing with colours, and cleaning up, people bathe, put on clean clothes, and visit friends and family.Like Holika Dahan, Kama Dahanam is celebrated in some parts of India. The festival of colours in these parts is called Rangapanchami, and occurs on the fifth day after Poornima (full moon)",
                "HIS":"The Holi festival is an ancient Hindu festival with its cultural rituals. The festival finds color in numerous scriptures, such as in works like Jaimini's Purva Mimamsa Sutras and Kathaka-Grhya-Sutras with even detailed descriptions in ancient texts like the Narad Purana and Bhavishyad Purana. The festival of “holikotsav” was also mentioned in the 7th century work, Ratnavali, by King Harsha.[41] It is mentioned in the Puranas, Dasakumara Charita, and by the poet Kālidāsa during the 4th century reign of Chandragupta II.[10] The celebration of Holi is also mentioned in the 7th-century Sanskrit drama Ratnavali.[42] The festival of Holi caught the fascination of European traders and British colonial staff by the 17th century. Various old editions of Oxford English Dictionary mention it, but with varying, phonetically derived spellings: Houly (1687), Hooly (1698), Huli (1789), Hohlee (1809), Hoolee (1825), and Holi in editions published after 1910"
            }
        
    },
    {
        "id": 3,
        "title":"The Carnival of Brazil",
        "img":"/images/Carnaval.jpg",
        "DM":"The Carnival of Brazil (Portuguese: Carnaval do Brasil,  is an annual festival held the Friday afternoon before Ash Wednesday at noon, which marks ...",
        "Detail":
            {   
                "id":3,
                "time":"April 20 to April, 2022",
                "DS":"The Carnival of Brazil (Portuguese: Carnaval do Brasil, IPA: [kaʁnaˈvaw]) is an annual festival held the Friday afternoon before Ash Wednesday at noon, which marks the beginning of Lent, the forty-day period before Easter. During Lent, Roman Catholics and some other Christians traditionally abstained from the consumption of meat and poultry, hence the term carnival, from carnelevare, to remove (literally, raise) meat.Carnival is the most popular holiday in Brazil and has become an event of huge proportions.[3][4][5][6] Except for industrial production, retail establishments such as malls, and carnival-related businesses, the country unifies completely for almost a week and festivities are intense, day and night, mainly in coastal cities.[7] Rio de Janeiro's carnival alone drew 4.9 million people in 2011, with 400,000 being foreignersHistorically its origins can be traced to the Portuguese Age of Discoveries when their caravels passed regularly through Madeira island, a territory which already celebrated emphatically its carnival season, and where they were loaded with goods but also people and their ludic and cultural expressions",
                "HIS":"The origins of the Rio Carnival celebration dates back to the 16th and 17th centuries. Carnival was brought to Brazil by Portuguese colonizers between the 16th and 17th centuries, manifesting itself initially through the 'Entrudo', a popular festival where public games and lighthearted mockery would run wild in the streets. Over time, the festival acquired other ways of manifesting itself, such as in the use of masks and costumes. The emergence of carnival societies created by the monarch elite also contributed to the popularization of the party among the poor.In 1840, the very first Rio masquerade took place, and polka and waltz took center stage.[3] Later in the beginning of the 20th century the Samba and Batucada rhythms classically associated with Rio carnival were introduced by afro-brazilians and pardos, by adapting different cultural inputs to produce a new musical genre. During this period, Carnival assumed its position as the biggest popular festival in Brazil."
            }
    },
    {
        "id": 4,
        "title":"Day of the Dead",
        "img":"/images/dayofdead.jpg",
        "DM":"The Day of the Dead (Spanish: Día de Muertos or Día de los Muertos) is a holiday traditionally celebrated on November 1 and 2, though other days,..",
        "Detail":
        {   
            "id":4,
            "time":"begins Tuesday, October 31 (in 35 days)ends Thursday, November 2",
            "DS":"The Day of the Dead (Spanish: Día de Muertos or Día de los Muertos)[2][3] is a holiday traditionally celebrated on November 1 and 2, though other days, such as October 31 or November 6, may be included depending on the locality.[4][5][6] It is widely observed in Mexico, where it largely developed, and is also observed in other places, especially by people of Mexican heritage. Although related to the simultaneous Christian remembrances for Hallowtide,[1] it has a much less solemn tone and is portrayed as a holiday of joyful celebration rather than mourning.[7] The multi-day holiday involves family and friends gathering to pay respects and to remember friends and family members who have died. These celebrations can take a humorous tone, as celebrants remember funny events and anecdotes about the departedTraditions connected with the holiday include honoring the deceased using calaveras and marigold flowers known as cempazúchitl, building home altars called ofrendas with the favorite foods and beverages of the departed, and visiting graves with these items as gifts for the deceased.[9] The celebration is not solely focused on the dead, as it is also common to give gifts to friends such as candy sugar skulls, to share traditional pan de muerto with family and friends, and to write light-hearted and often irreverent verses in the form of mock epitaphs dedicated to living friends and acquaintances, a literary form known as calaveras literarias.",
            "HIS":"Mexican academics are divided on whether the festivity has genuine indigenous pre-Hispanic roots or whether it is a 20th-century rebranded version of a Spanish tradition developed during the presidency of Lázaro Cárdenas to encourage Mexican nationalism through an Aztec identity.[12][13][14] The festivity has become a national symbol in recent decades and it is taught in the nation's school system asserting a native origin.[15] In 2008, the tradition was inscribed in the Representative List of the Intangible Cultural Heritage of Humanity by UNESCO.[11]"
        }
    },
    {
        "id": 5,
        "title":"Trang An traditional festival",
        "img":"/images/trangan.jpg",
        "DM":"The festival is held annually to celebrate Saint Quy Minh Dai Vuong, a general under the reign of the 18 th Hung King. During the two-day festival,..",
        "Detail":
        {   
            "id":1,
            "time":"",
            "DS":"",
            "HIS":""
        }
    },
    {
        "id": 6,
        "title":"Mardi Gras",
        "img":"/images/Mardi.jpg",
        "DM":"Mardi Gras refers to events of the Carnival celebration, beginning on or after the Christian feasts of the Epiphany (Three Kings Day) and culminating ...",
        "Detail":
        {   
            "id":2,
            "time":"Mardi Gras 2024: Tuesday, February 13",
            "DS":"refers to events of the Carnival celebration, beginning on or after the Christian feasts of the Epiphany (Three Kings Day) and culminating on the day before Ash Wednesday, which is known as Shrove Tuesday. Mardi Gras is French for Fat Tuesday, reflecting the practice of the last night of eating rich, fatty foods before the ritual Lenten sacrifices and fasting of the Lenten season. Related popular practices are associated with Shrovetide celebrations before the fasting and religious obligations associated with the penitential season of Lent. In countries such as the United Kingdom, Mardi Gras is more usually known as Pancake Day or (traditionally) Shrove Tuesday, derived from the word shrive, meaning to administer the sacrament of confession to; to absolve",
            "HIS":"Carnival is a Western Christian festive season that occurs before the liturgical season of Lent.[2] The main events typically occur during February or early March, during the period historically known as Shrovetide (or Pre-Lent). Carnival typically involves public celebrations, including events such as parades, public street parties and other entertainments, combining some elements of a circus. Elaborate costumes and masks allow people to set aside their everyday individuality and experience a heightened sense of social unity.[3] Participants often indulge in excessive consumption of alcohol,[4] meat, and other foods that will be forgone during upcoming Lent. Traditionally, butter, milk, and other animal products were not consumed excessively, rather, their stock was fully consumed during Shrovetide as to reduce waste. This festival is known for being a time of great indulgence before Lent (which is a time stressing the opposite), with drinking, overeating, and various other activities of indulgence being performed. For example, pancakes, donuts, and other desserts are prepared and eaten for a final time. During Lent, lacticinia and animal products are eaten less, and individuals make a Lenten sacrifice, thus giving up a certain object or activity of desire."
        }
    },
    {
        "id": 7,
        "title":"Krampus festival",
        "img":"/images/krampus.jpg",
        "DM":"Krampus is a horned, anthropomorphic figure in the Central and Eastern Alpine folklore of Europe who, during the Advent season, scares children who ...",
        "Detail":
        {   
            "id":3,
            "time":"",
            "DS":"Krampus is a horned, anthropomorphic figure in the Central and Eastern Alpine folklore of Europe who, during the Advent season, scares children who have misbehaved. Assisting Saint Nicholas, or Santa Claus, the pair visit children on the night of 6 December, with Saint Nicholas rewarding the well-behaved children with gifts such as oranges, dried fruit, walnuts and chocolate, while the badly behaved ones only receive punishment from Krampus with birch rods. Krampus day itself, on the other hand, is on the 5th of December.The origin of the figure is unclear; some folklorists and anthropologists have postulated it as having pre-Christian origins.[2] In traditional parades and in such events as the Krampuslauf (English: Krampus run), young men dressed as Krampus attempt to scare the audience with their antics.[3] Such events occur annually in most Alpine towns.[4] Krampus is featured on holiday greeting cards called Krampuskarten.",
            "HIS":"The history of the Krampus figure has been theorized as stretching back to pre-Christian Alpine traditions,[2][7] with celebrations involving Krampus dating back to the 6th or 7th century CE.[7] Though there are no written sources before the end of the 16th centuryIn the aftermath of the 1932 election in Austria, the Krampus tradition was prohibited by the Dollfuss regime[11] under the clerical fascist Fatherland Front (Vaterländische Front) and the Christian Social Party. In the 1950s, the government distributed pamphlets titled Krampus Is an Evil Man.[12] Towards the end of the century, a popular resurgence of Krampus celebrations occurred and continues todayThe Krampus tradition is being revived in Bavaria as well, along with a local artistic tradition of hand-carved wooden masks.[14][15] In 2019 there were reports of drunken or disorderly conduct by masked Krampuses in some Austrian towns."
        }
    },
    {
        "id": 8,
        "title":"The Gion Festival",
        "img":"/images/TheGionFestival.jpg",
        "DM":"The Gion Festival is one of the largest and most famous festivals in Japan, taking place annually during the month of July in Kyoto ,Many events take place in central Kyoto ,...",
        "Detail":
        {   
            "id":4,
            "time":"1 July. Ends. 31 July. Date. Month of July",
            "DS":"The Gion Festival (祇園祭, Gion Matsuri) is one of the largest and most famous festivals in Japan, taking place annually during the month of July in Kyoto.[1] Many events take place in central Kyoto and at the Yasaka Shrine, the festival's patron shrine, located in Kyoto's famous Gion district, which gives the festival its name.[1] It is formally a Shinto festival, and its original purposes were purification and pacification of disease-causing entities.[2] There are many ceremonies held during the festival, but it is best known for its two Yamaboko Junkō (山鉾巡行) processions of floats, which take place on July 17 and 24The three nights leading up to each day of a procession are sequentially called yoiyoiyoiyama (宵々々山), yoiyoiyama (宵々山), and yoiyama (宵山). During these yoiyama evenings, Kyoto's downtown area is reserved for pedestrian traffic, and some traditional private houses near the floats open their entryways to the public, exhibiting family heirlooms in a custom known as the Folding Screen Festival (屏風祭り, Byōbu Matsuri). Additionally, the streets are lined with night stalls selling food such as yakitori (barbecued chicken on skewers), taiyaki, takoyaki (fried octopus balls), okonomiyaki, traditional Japanese sweets, and many other culinary delights.",
            "HIS":"The Gion Festival originated during an epidemic as part of a purification ritual (goryo-e) to appease the gods thought to cause fire, floods, and earthquakes.[4] In 869, when people were suffering from a plague attributed to vengeful spirits, Emperor Seiwa ordered prayers to Susanoo-no-Mikoto, the god of the Yasaka Shrine. Sixty-six stylized and decorated halberds, one for each of the traditional provinces of Japan, were prepared and erected at Shinsen-en, a garden in the south of the imperial palace, along with mikoshi (御輿, 'portable shrines') from Yasaka Shrine. This practice was repeated wherever an outbreak of plague occurred. By the year 1000, the festival became an annual event and it has since seldom failed to take place. During the civil Onin War (under the Ashikaga shogunate), central Kyoto was devastated, and the festival was halted for three decades in the late 15th and early 16th centuries.[3] Later in the 16th century, it was revived by the shogun Oda Nobunaga."
        }
    }

]