
[
    {
        "id": 1,
        "title":"Diwali Festival",
        "img":"/images/Dehi.jpg",
        "DM":" Hindu festival of lights with its variations also celebrated in other Indian religions. It symbolises the spiritual victory of light over darkness, good over evil, and ...",
        "Detail":
            {   
                "ED":2,
                "id":2,
                "time":"The five-day celebration is observed every year in early autumn after the conclusion of the summer harvest. It coincides with the new moon (amāvasyā) and is deemed the darkest night of the Hindu lunisolar calendar.[45] The festivities begin two days before amāvasyā, on Dhanteras, and extend two days after, until the second (or 17th) day of the month of Kartik",
                "DS":"Diwali; Deepavali  or Divali; is the Hindu festival of lights with its variations also celebrated in other Indian religions. It symbolises the spiritual victory of light over darkness, good over evil, and knowledge over ignorance. Diwali is celebrated during the Hindu lunisolar months of Ashvin (according to the amanta tradition) and Kartika—between around mid-September and mid-November.[8][9][10][11] The celebrations generally last five or six days Diwali is connected to various religious events, deities and personalities, such as being the day Rama returned to his kingdom in Ayodhya with his wife Sita and his brother Lakshmana after defeating the demon king Ravana.[14] It is also widely associated with Lakshmi, the goddess of prosperity and Ganesha, the god of wisdom and the remover of obstacles.[15] Other regional traditions connect the holiday to Vishnu, Krishna, Durga, Shiva, Kali, Hanuman, Kubera, Yama, Yami, Dhanvantari, or Vishvakarman.Primarily a Hindu festival, variations of Diwali are also celebrated by adherents of other faiths.[12] The Jains observe their own Diwali which marks the final liberation of Mahavira,[16][17] the Sikhs celebrate Bandi Chhor Divas to mark the release of Guru Hargobind from a Mughal prison.[18] Newar Buddhists, unlike other Buddhists, celebrate Diwali by worshipping Lakshmi, while the Hindus of Eastern India and Bangladesh generally celebrate Diwali by worshipping the goddess Kali.During the festival, the celebrants illuminate their homes, temples and workspaces with diyas (oil lamps), candles and lanterns.[7] Hindus, in particular, have a ritual oil bath at dawn on each day of the festival.[22] Diwali is also marked with fireworks and the decoration of floors with rangoli designs, and other parts of the house with jhalars. Food is a major focus with families partaking in feasts and sharing mithai.[23] The festival is an annual homecoming and bonding period not only for families,[14][15] but also for communities and associations, particularly those in urban areas, which will organise activities, events and gatherings.[24][25] Many towns organise community parades and fairs with parades or music and dance performances in parks.[26] Some Hindus, Jains and Sikhs will send Diwali greeting cards to family near and far during the festive season, occasionally with boxes of Indian confectionery.[26] Another aspect of the festival is remembering the ancestors.[27]Diwali is also a major cultural event for the Hindu, Sikh, and Jain diaspora.[28][29][30] The main day of the festival of Diwali (the day of Lakshmi Puja) is an official holiday in Fiji,[31] Guyana,[32] India, Malaysia,[b][33] Mauritius, Myanmar,[34] Nepal,[35] Pakistan,[36] Singapore,[37] Sri Lanka, Suriname, and Trinidad and Tobago.[38]",
                "HIS":"The five-day long festival originated in the Indian subcontinent and is likely a fusion of harvest festivals in ancient India.[47] It is mentioned in early Sanskrit texts, such as the Padma Purana and the Skanda Purana, both of which were completed in the second half of the 1st millennium CE. The diyas (lamps) are mentioned in Skanda Kishore Purana as symbolising parts of the sun, describing it as the cosmic giver of light and energy to all life and which seasonally transitions in the Hindu calendar month of Kartik.Emperor Harsha refers to Deepavali, in the 7th-century Sanskrit play Nagananda, as Dīpapratipadotsava (dīpa = light, pratipadā = first day, utsava = festival), where lamps were lit and newly engaged brides and grooms received gifts.[53][54] Rajasekhara referred to Deepavali as Dipamalika in his 9th-century Kavyamimamsa, wherein he mentions the tradition of homes being whitewashed and oil lamps decorated homes, streets and markets in the nightDiwali was also described by numerous travelers from outside India. In his 11th-century memoir on India, the Persian traveler and historian Al Biruni wrote of Deepavali being celebrated by Hindus on the day of the New Moon in the month of Kartika.[55] The Venetian merchant and traveler Niccolò de' Conti visited India in the early 15th-century and wrote in his memoir, on another of these festivals they fix up within their temples, and on the outside of the roofs, an innumerable number of oil lamps... which are kept burning day and night and that the families would gather, clothe themselves in new garments, sing, dance and feast.[56][57] The 16th-century Portuguese traveler Domingo Paes wrote of his visit to the Hindu Vijayanagara Empire, where Dipavali was celebrated in October with householders illuminating their homes, and their temples, with lamps.[57] It is mentioned in the Ramayana that Diwali was celebrated for only 2 years in Ayodhya.[58]"
            }
    },
    {
        "id": 2,
        "title":"The Holi festival",
        "img":"/images/holi.jpg",
        "DM":"Holi is a popular and significant Hindu festival celebrated as the Festival of Colours, Love and Spring.It celebrates the eternal and divine love of ...",
        "Detail":
            {   
                "ED":1,
                "id":2,
                "time":"Holi 2024:Monday, March 25",
                "DS":"Holi is a sacred ancient tradition of Hindus, a holiday in many states of India and Nepal with regional holidays in other countries. To many Hindus and some non-Hindus, it is a playful cultural event and an excuse to throw coloured water at friends or strangers in jest. It is also observed broadly in the Indian subcontinent. Holi is celebrated at the end of winter, on the last full moon day of the Hindu luni-solar calendar month marking the spring, making the date vary with the lunar cycle.[note 1] The date falls typically in March, but sometimes late February of the Gregorian calendar,The festival has many purposes; most prominently, it celebrates the beginning of Spring. In 17th century literature, it was identified as a festival that celebrated agriculture, commemorated good spring harvests and the fertile land.[18] Hindus believe it is a time of enjoying spring's abundant colours and saying farewell to winter. To many Hindus, Holi festivities mark an occasion to reset and renew ruptured relationships, end conflicts and rid themselves of accumulated emotional impurities from the past.It also has a religious purpose, symbolically signified by the legend of Holika. The night before Holi, bonfires are lit in a ceremony known as Holika Dahan (burning of Holika) or Little Holi People gather near fires, sing and dance. The next day, Holi, also known as Dhuli in Sanskrit, or Dhulheti, Dhulandi or Dhulendi, is celebrated.In Northern parts of India, children and youth spray coloured powder solutions (gulal) at each other, laugh and celebrate, while adults smear dry coloured powder (abir) on each other's faces.[5][35] Visitors to homes are first teased with colours, then served with Holi delicacies (such as puranpoli, dahi-bada and gujia), desserts and drinks.[37][38][39] After playing with colours, and cleaning up, people bathe, put on clean clothes, and visit friends and family.Like Holika Dahan, Kama Dahanam is celebrated in some parts of India. The festival of colours in these parts is called Rangapanchami, and occurs on the fifth day after Poornima (full moon)",
                "HIS":"The Holi festival is an ancient Hindu festival with its cultural rituals. The festival finds color in numerous scriptures, such as in works like Jaimini's Purva Mimamsa Sutras and Kathaka-Grhya-Sutras with even detailed descriptions in ancient texts like the Narad Purana and Bhavishyad Purana. The festival of “holikotsav” was also mentioned in the 7th century work, Ratnavali, by King Harsha.[41] It is mentioned in the Puranas, Dasakumara Charita, and by the poet Kālidāsa during the 4th century reign of Chandragupta II.[10] The celebration of Holi is also mentioned in the 7th-century Sanskrit drama Ratnavali.[42] The festival of Holi caught the fascination of European traders and British colonial staff by the 17th century. Various old editions of Oxford English Dictionary mention it, but with varying, phonetically derived spellings: Houly (1687), Hooly (1698), Huli (1789), Hohlee (1809), Hoolee (1825), and Holi in editions published after 1910"
            }
        
    },
    {
        "id": 3,
        "title":"The Carnival of Brazil",
        "img":"/images/Carnaval.jpg",
        "DM":"The Carnival of Brazil (Portuguese: Carnaval do Brasil,  is an annual festival held the Friday afternoon before Ash Wednesday at noon, which marks ...",
        "Detail":
            {   
                "ED":1,
                "id":3,
                "time":"April 20 to April, 2022",
                "DS":"The Carnival of Brazil (Portuguese: Carnaval do Brasil, IPA: [kaʁnaˈvaw]) is an annual festival held the Friday afternoon before Ash Wednesday at noon, which marks the beginning of Lent, the forty-day period before Easter. During Lent, Roman Catholics and some other Christians traditionally abstained from the consumption of meat and poultry, hence the term carnival, from carnelevare, to remove (literally, raise) meat.Carnival is the most popular holiday in Brazil and has become an event of huge proportions.[3][4][5][6] Except for industrial production, retail establishments such as malls, and carnival-related businesses, the country unifies completely for almost a week and festivities are intense, day and night, mainly in coastal cities.[7] Rio de Janeiro's carnival alone drew 4.9 million people in 2011, with 400,000 being foreignersHistorically its origins can be traced to the Portuguese Age of Discoveries when their caravels passed regularly through Madeira island, a territory which already celebrated emphatically its carnival season, and where they were loaded with goods but also people and their ludic and cultural expressions",
                "HIS":"The origins of the Rio Carnival celebration dates back to the 16th and 17th centuries. Carnival was brought to Brazil by Portuguese colonizers between the 16th and 17th centuries, manifesting itself initially through the 'Entrudo', a popular festival where public games and lighthearted mockery would run wild in the streets. Over time, the festival acquired other ways of manifesting itself, such as in the use of masks and costumes. The emergence of carnival societies created by the monarch elite also contributed to the popularization of the party among the poor.In 1840, the very first Rio masquerade took place, and polka and waltz took center stage.[3] Later in the beginning of the 20th century the Samba and Batucada rhythms classically associated with Rio carnival were introduced by afro-brazilians and pardos, by adapting different cultural inputs to produce a new musical genre. During this period, Carnival assumed its position as the biggest popular festival in Brazil."
            }
    },
    {
        "id": 4,
        "title":"Day of the Dead",
        "img":"/images/dayofdead.jpg",
        "DM":"The Day of the Dead (Spanish: Día de Muertos or Día de los Muertos) is a holiday traditionally celebrated on November 1 and 2, though other days,..",
        "Detail":
        {   
            "ED":5,
            "id":4,
            "time":"begins Tuesday, October 31 (in 35 days)ends Thursday, November 2",
            "DS":"The Day of the Dead (Spanish: Día de Muertos or Día de los Muertos)[2][3] is a holiday traditionally celebrated on November 1 and 2, though other days, such as October 31 or November 6, may be included depending on the locality.[4][5][6] It is widely observed in Mexico, where it largely developed, and is also observed in other places, especially by people of Mexican heritage. Although related to the simultaneous Christian remembrances for Hallowtide,[1] it has a much less solemn tone and is portrayed as a holiday of joyful celebration rather than mourning.[7] The multi-day holiday involves family and friends gathering to pay respects and to remember friends and family members who have died. These celebrations can take a humorous tone, as celebrants remember funny events and anecdotes about the departedTraditions connected with the holiday include honoring the deceased using calaveras and marigold flowers known as cempazúchitl, building home altars called ofrendas with the favorite foods and beverages of the departed, and visiting graves with these items as gifts for the deceased.[9] The celebration is not solely focused on the dead, as it is also common to give gifts to friends such as candy sugar skulls, to share traditional pan de muerto with family and friends, and to write light-hearted and often irreverent verses in the form of mock epitaphs dedicated to living friends and acquaintances, a literary form known as calaveras literarias.",
            "HIS":"Mexican academics are divided on whether the festivity has genuine indigenous pre-Hispanic roots or whether it is a 20th-century rebranded version of a Spanish tradition developed during the presidency of Lázaro Cárdenas to encourage Mexican nationalism through an Aztec identity.[12][13][14] The festivity has become a national symbol in recent decades and it is taught in the nation's school system asserting a native origin.[15] In 2008, the tradition was inscribed in the Representative List of the Intangible Cultural Heritage of Humanity by UNESCO.[11]"
        }
    },
    {
        "id": 5,
        "title":"Trang An traditional festival",
        "img":"/images/trangan.jpg",
        "DM":"The festival is held annually to celebrate Saint Quy Minh Dai Vuong, a general under the reign of the 18 th Hung King. During the two-day festival,..",
        "Detail":
        {   
            "ED":5,
            "id":1,
            "time":"",
            "DS":"Trang An Festival is held annually on the 18th day of the 3rd lunar month to commemorate the legendary national hero Saint Quy Minh for his great contributions to protecting the country under the reign of the 18th Hung King.The 3-day festival features both solemn traditional festive and entertainment activities which help to promote the historical and cultural beauty in Ninh Binh Province.Various solemn traditional festive activities include the dragon procession, palanquin procession, and an incense offering ceremony in commemoration of legendary national hero Saint Quy Minh.Also, there are a number of exciting cultural and sporting activities such as folk games, traditional competitions, and ‘ca tru’ (ceremonial singing) and ‘hat van’ (spiritual singing) performances.Look at some nice photos below, taken by our freelance photographer Huu Thanh, to gain a better understanding of this unique tradition festival in Ninh Binh Province. Some were captured before the pandemic.",
            "HIS":""
        }
    },
    {
        "id": 6,
        "title":"Mardi Gras",
        "img":"/images/Mardi.jpg",
        "DM":"Mardi Gras refers to events of the Carnival celebration, beginning on or after the Christian feasts of the Epiphany (Three Kings Day) and culminating ...",
        "Detail":
        {   
            "ED":5,
            "id":2,
            "time":"Mardi Gras 2024: Tuesday, February 13",
            "DS":"refers to events of the Carnival celebration, beginning on or after the Christian feasts of the Epiphany (Three Kings Day) and culminating on the day before Ash Wednesday, which is known as Shrove Tuesday. Mardi Gras is French for Fat Tuesday, reflecting the practice of the last night of eating rich, fatty foods before the ritual Lenten sacrifices and fasting of the Lenten season. Related popular practices are associated with Shrovetide celebrations before the fasting and religious obligations associated with the penitential season of Lent. In countries such as the United Kingdom, Mardi Gras is more usually known as Pancake Day or (traditionally) Shrove Tuesday, derived from the word shrive, meaning to administer the sacrament of confession to; to absolve",
            "HIS":"Carnival is a Western Christian festive season that occurs before the liturgical season of Lent.[2] The main events typically occur during February or early March, during the period historically known as Shrovetide (or Pre-Lent). Carnival typically involves public celebrations, including events such as parades, public street parties and other entertainments, combining some elements of a circus. Elaborate costumes and masks allow people to set aside their everyday individuality and experience a heightened sense of social unity.[3] Participants often indulge in excessive consumption of alcohol,[4] meat, and other foods that will be forgone during upcoming Lent. Traditionally, butter, milk, and other animal products were not consumed excessively, rather, their stock was fully consumed during Shrovetide as to reduce waste. This festival is known for being a time of great indulgence before Lent (which is a time stressing the opposite), with drinking, overeating, and various other activities of indulgence being performed. For example, pancakes, donuts, and other desserts are prepared and eaten for a final time. During Lent, lacticinia and animal products are eaten less, and individuals make a Lenten sacrifice, thus giving up a certain object or activity of desire."
        }
    },
    {
        "id": 7,
        "title":"Krampus festival",
        "img":"/images/krampus.jpg",
        "DM":"Krampus is a horned, anthropomorphic figure in the Central and Eastern Alpine folklore of Europe who, during the Advent season, scares children who ...",
        "Detail":
        {   
            "ED":5,
            "id":3,
            "time":"",
            "DS":"Krampus is a horned, anthropomorphic figure in the Central and Eastern Alpine folklore of Europe who, during the Advent season, scares children who have misbehaved. Assisting Saint Nicholas, or Santa Claus, the pair visit children on the night of 6 December, with Saint Nicholas rewarding the well-behaved children with gifts such as oranges, dried fruit, walnuts and chocolate, while the badly behaved ones only receive punishment from Krampus with birch rods. Krampus day itself, on the other hand, is on the 5th of December.The origin of the figure is unclear; some folklorists and anthropologists have postulated it as having pre-Christian origins.[2] In traditional parades and in such events as the Krampuslauf (English: Krampus run), young men dressed as Krampus attempt to scare the audience with their antics.[3] Such events occur annually in most Alpine towns.[4] Krampus is featured on holiday greeting cards called Krampuskarten.",
            "HIS":"The history of the Krampus figure has been theorized as stretching back to pre-Christian Alpine traditions,[2][7] with celebrations involving Krampus dating back to the 6th or 7th century CE.[7] Though there are no written sources before the end of the 16th centuryIn the aftermath of the 1932 election in Austria, the Krampus tradition was prohibited by the Dollfuss regime[11] under the clerical fascist Fatherland Front (Vaterländische Front) and the Christian Social Party. In the 1950s, the government distributed pamphlets titled Krampus Is an Evil Man.[12] Towards the end of the century, a popular resurgence of Krampus celebrations occurred and continues todayThe Krampus tradition is being revived in Bavaria as well, along with a local artistic tradition of hand-carved wooden masks.[14][15] In 2019 there were reports of drunken or disorderly conduct by masked Krampuses in some Austrian towns."
        }
    },
    {
        "id": 8,
        "title":"The Gion Festival",
        "img":"/images/TheGionFestival.jpg",
        "DM":"The Gion Festival is one of the largest and most famous festivals in Japan, taking place annually during the month of July in Kyoto ,Many events take place in central Kyoto ,...",
        "Detail":
        {   
            "ED":5,
            "id":4,
            "time":"1 July. Ends. 31 July. Date. Month of July",
            "DS":"The Gion Festival (祇園祭, Gion Matsuri) is one of the largest and most famous festivals in Japan, taking place annually during the month of July in Kyoto.[1] Many events take place in central Kyoto and at the Yasaka Shrine, the festival's patron shrine, located in Kyoto's famous Gion district, which gives the festival its name.[1] It is formally a Shinto festival, and its original purposes were purification and pacification of disease-causing entities.[2] There are many ceremonies held during the festival, but it is best known for its two Yamaboko Junkō (山鉾巡行) processions of floats, which take place on July 17 and 24The three nights leading up to each day of a procession are sequentially called yoiyoiyoiyama (宵々々山), yoiyoiyama (宵々山), and yoiyama (宵山). During these yoiyama evenings, Kyoto's downtown area is reserved for pedestrian traffic, and some traditional private houses near the floats open their entryways to the public, exhibiting family heirlooms in a custom known as the Folding Screen Festival (屏風祭り, Byōbu Matsuri). Additionally, the streets are lined with night stalls selling food such as yakitori (barbecued chicken on skewers), taiyaki, takoyaki (fried octopus balls), okonomiyaki, traditional Japanese sweets, and many other culinary delights.",
            "HIS":"The Gion Festival originated during an epidemic as part of a purification ritual (goryo-e) to appease the gods thought to cause fire, floods, and earthquakes.[4] In 869, when people were suffering from a plague attributed to vengeful spirits, Emperor Seiwa ordered prayers to Susanoo-no-Mikoto, the god of the Yasaka Shrine. Sixty-six stylized and decorated halberds, one for each of the traditional provinces of Japan, were prepared and erected at Shinsen-en, a garden in the south of the imperial palace, along with mikoshi (御輿, 'portable shrines') from Yasaka Shrine. This practice was repeated wherever an outbreak of plague occurred. By the year 1000, the festival became an annual event and it has since seldom failed to take place. During the civil Onin War (under the Ashikaga shogunate), central Kyoto was devastated, and the festival was halted for three decades in the late 15th and early 16th centuries.[3] Later in the 16th century, it was revived by the shogun Oda Nobunaga."
        }
    },

    {
        "id": 9,
        "title":"Black-necked Crane Festival",
        "img":"/images/Bhutan.jpg",
        "DM":"Perched on a forest-clad hill overlooking the Phobjikha Valley, Gangtey Goemba is one of the oldest and largest ,...",
        "Detail":
        {   
            "ED":1,
            "id":1,
            "time":"Early November to end of March",
            "DS":"Perched on a forest-clad hill overlooking the Phobjikha Valley, Gangtey Goemba is one of the oldest and largest Nyingmapa monasteries in Bhutan. Every November, local children, farmers, and monks flood the monastery’s courtyard to celebrate the arrival of some beloved visitors: black-necked cranes, among the rarest cranes in the world—several hundred of which migrate here each year. The cranes travel from their summer breeding grounds on the Tibetan Plateau to this picturesque Bhutanese valley, where they feed on the dwarf bamboo that grows in the valleys alpine wetlands. During the winter months, as they roost amid the farms and cottages of Phobjikha, they form an integral part of life for the people who live here.The only alpine crane species in the world, the black-necked crane is considered a sacred bird in Bhutan, revered as a symbol of longevity. With a bright red crown, black neck, and up to eight-foot wing span, the birds are both distinctive and majestic. They are the subject of Bhutanese folktales and songs, and are painted on the walls of temples throughout the country. In the Phobjikha Valley, residents honor and protect these graceful creatures, whose presence is believed to bring about bountiful harvests and prosperity.",
            "HIS":"In recent years, Bhutan has taken steps to ensure the protection of the cranes and safeguard their passage to the valley. In 2008, when the introduction of electrical power lines threatened the cranes’ migration route, the Royal Society for Protection of Nature (RSPN), a nonprofit organization in Bhutan, successfully lobbied for an underground power grid instead. RSPN has also spearheaded projects with the local community to ensure a peaceful coexistence between birds and people, such as expanded protection of their wetland habitat. All of which is in keeping with Bhutan’s guiding philosophy of Gross National Happiness, which emphasizes a harmonious and sustainable balance between economic growth and the all-important non-material aspects of human well-being.The Black-necked Crane Festival, which began in 1998, draws an increasing number of travelers to this remote valley each year, creating a valuable revenue stream for Bhutanese residents. The one-day event at Gangtey Goemba provides an opportunity for locals to celebrate the arrival of the cranes, showcase their cultural heritage through masked folk dances and songs, and raise awareness about conservation issues. For visitors, it’s not only an opportunity to experience one of Bhutan’s most famed festivals—it’s also a chance to pay homage to this sacred bird while supporting a community that is working to protect it.Travelers can experience the Black-necked Crane Festival firsthand on select departures of National Geographic’s Bhutan: Kingdom in the Clouds expedition, which includes 11 days of exploration in the remote Buddhist kingdom alongside a National Geographic Expert. Learn more about the itinerary as well as other trips to Bhutan with National Geographic."
        } 
    },
    {
        "id": 10,
        "title":"The Harbin International Ice and Snow festival",
        "img":"/images/harbin.jpg",
        "DM":" The Harbin International Ice and Snow festival is an annual winter festival that takes place with a theme in Harbin,..",
        "Detail":
        {   
            "ED":1,
            "id":2,
            "time":"opened on January ",
            "DS":"The Harbin International Ice and Snow festival is an annual winter festival that takes place with a theme in Harbin, Heilongjiang, China, and now is the largest ice and snow festival in the world. At first participants in the festival were mainly Chinese, however it has since become an international festival and competition, with the festival attracting 18 million visitors and generating 28.7 billion yuan ($4.4 billion) of revenue.[1] The festival includes the world's biggest ice sculptures.Ice and Snow World is an area open in the afternoon and at night which features illuminated full size buildings made from blocks of 2–3' thick ice taken directly from the Songhua River. The park usually opens from late December to late February. In 1999, the first Ice and Snow World opened to public to celebrate the millennium. Each year the park has to be rebuilt with newly designed ice buildings and snow and ice sculptures. In recent years, the park has been as large as 800 meters (80 hectares).",
            "HIS":"The festival originated in Harbin's traditional ice lantern show and garden party that takes place in winter, which began in 1963. It was interrupted for a number of years during the Cultural Revolution, but has since been resumed when an annual event at Zhaolin Park was announced on January 5, 1985.In 2001 the Harbin Ice Festival was merged with Heilongjiang's International Ski Festival and got its new formal name, the Harbin International Ice and Snow Sculpture Festival.In 2007, the festival featured a Canadian themed sculpture, in memory of Canadian doctor Norman Bethune. It was awarded a Guinness World Record for the world's largest snow sculpture: 250 metres long, 28 feet (8.5 m) high, using over 13,000 cubic metres of snow. The composition consisted of two parts: the Niagara Falls and the crossing the Bering Strait (the latter depicting the migration of the First Nations).In 2014, the festival celebrated its 30th anniversary with the theme 50-Year Ice Snow, Charming Harbin. Various fairs, competitions and expos were held from December 20, 2013 to February 28, 2014.n 2015, the 31st Harbin Ice Snow Festival opened on January 5 and was themed Ice Snow Harbin, Charming China Dreams around the world with opening ceremony, firework show, ice lanterns, birthday parties, snow sculpture competitions and expos, as well as winter swimming, winter fishing, group wedding ceremony, fashion shows, concerts, ice sport games lasting from December 22, 2014 to early March 2015.At the 35th annual festival held in 2019, the festival's most popular attraction, the Harbin Ice and Snow World, took up over 600,000 square meters and included more than 100 landmarks. It was made from 110,000 cubic meters of ice and 120,000 cubic meters of snow. The festival also included ice sculptures by artists from 12 different countries competing in the annual competition."
        }
    },
    {
        "id": 11,
        "title":"Naadam festival",
        "img":"/images/naadam.jpg",
        "DM":"Naadam (Mongolian Naadam Festival) is a traditional festival celebrated in Mongolia, Inner Mongolia and Tuva Republic.The festival is also locally termed,...",
        "Detail":
        {   
            "ED":1,
            "id":3,
            "time":"July 11 to July 15",
            "DS":"Naadam (Mongolian Naadam Festival) is a traditional festival celebrated in Mongolia, Inner Mongolia and Tuva Republic.The festival is also locally termed eriin gurvan naadam (эрийн гурван наадам), the three games of men.The games are Mongolian wrestling, horse racing, and archery, and are held throughout the country during midsummer. Women have started participating in the archery and girls in the horse-racing games, but not in Mongolian wrestlingIn 2010, Naadam was inscribed on the Representative List of the Intangible Cultural Heritage of Humanity of UNESCO.",
            "HIS":"Naadam is the most widely watched festival among Mongols and is believed to have existed for centuries in one fashion or another. It has its origin in the activities, such as military parades and sporting competitions such as archery, horse riding and wrestling, that followed the celebration of various occasions, including weddings or spiritual gatherings. It later served as a way to train soldiers for battle and was also connected to Mongols' nomadic lifestyle. Mongolians practice their unwritten holiday rules that include a long song to start the holiday, then a Biyelgee dance. Traditional cuisine, or Khuushuur, is served around the Sports Stadium along with a special drink made of fermented horse milk (airag). The three games of wrestling, horse racing, and archery are recorded in the 13th-century book The Secret History of the Mongols. During the Qing dynasty's rule, Naadam became a festival officially held by sums.It began to be held annually in 1639 with a dance festival dedicated to the High Saint Zanabazar. In this festival of Shireet White Lake, Bokh Lama won in wrestling, and Bonkhor Donir's horse won the championshipIn 1772, a great festival was held to worship Khentii mountain. It is called the Festival of Ten Governments. In 1912, the Ten Government Games, which used to be played with losing points, became an annual state game. Until the death of Bogd Khan in 1925, the Ten Government Festival became a state festival. Ten Government Games have been held 125 times."
        }
    },
    {
        "id": 12,
        "title":"Songkran festival",
        "img":"/images/Songkran.jpg",
        "DM":"Thai New Year or Songkran is the Thai New Year's national holiday. Songkran is on 13 April every year, but the holiday period extends from 14 to 15 April. In 2018 the,..",
        "Detail":
        {   
            "ED":1,
            "id":4,
            "time":"begins Saturday, April 13,ends Monday, April 15",
            "DS":"Thai New Year or Songkran is the Thai New Year's national holiday. Songkran is on 13 April every year, but the holiday period extends from 14 to 15 April. In 2018 theThai cabinet extended the festival nationwide to seven days, 9–16 April, to enable citizens to travel home for the holiday.[1] In 2019, the holiday was observed 9 16 April as 13 April fell on a Saturday. The word Songkran comes from the Sanskrit word saṃkrānti,literally astrological passage, meaning transformation or change. It coincides with the rising of Aries on the astrological chart[4] and with the New Year of many calendars of Southeast and South Asia, in keeping with the Buddhist and Hindu Calendar. The New Year takes place at around the same time as the new year celebrations of many countries in South Asia like Bangladesh, China (Dai people of Yunnan Province), India (Baisakhi in Punjab, Bengal Gajan Utsav, Bengal Charak Utsav, Bengali New Year (Poyla Baisakh/Nababarsha) in West Bengal and Tripura (Also Buisu/Bishu in Tripura), Bihu in Assam,Gudipadva in Maharashtra, Pana or Mahabisuba Sankranti in Odisha, Tamil Puthaandu (Tamil New Year) in Tamil Naadu, Ugadi in Andhra Pradesh and Karnataka, Vishu in Kerala etc.), Laos, Cambodia, Myanmar, Nepal, and Sri Lanka.In Thailand, New Year is now officially celebrated 1 January. Songkran was the official New Year until 1888, when it was switched to a fixed date of 1 April. Then in 1940, this date was shifted to 1 January. The traditional Thai New Year Songkran was transformed into a national holiday.[5] Celebrations are famous for the public water fights framed as ritual cleansing.",
            "HIS":"The origin of songkran festival lies in a Buddhist folk myth or non canonical jataka related to harvest and spring. In prosperous city of sukhavati in suvvannabhumi, bodistva born in household of poor farmer. Once upon times, Indra the king of devas, looked at the city from heaven, felt sad seeing high level of corruption. He found people do not respect their elders, behave rudely, don't serve them proper food and medicines. They have no compassion to needy and helpless. No faith in Sila and Uposath but fun in sins, no faith in donation but greedy for wealth, no faith in Dhamma but made business of Dhamma. By seeing decline of Dhamma, he said,Glory/Siri of humans lies in their faith in Dhamma. There is no Glory without Dhamma. With affirmation of this truth, people in the city immediately loss their glory, no proper rains, water and food scarcity prevailed, extreme drought with skin burning hot sun waves and dirtly bad smelled garbages were filled their homes.To get saved from this suffering, In leadership of bodistva, people prayed to mother earth or Siri. They asked Siri the causes and solutions of their misfortune. Out of compassion and sympathy to her children, she told them the causes and solutions to their sufferings. She told them restoration of their faith in Dhamma will end their suffering. She gave them a divine piece of fertile land, divine seeds, mysterious song for rain and pots divine thanaka powder of several colours to apply on their skin to cool body from hot sun waves. Now, people pleaged to observe sila and upasotha under guidance of bodistva.Bodistva and his companions started cultivating the divine land, sowing divine seeds. They used to apply several colours of thanaka powder and water is poured to cool their body from heavy sun waves. In few days their crops were grown that was the day when the sun entered aries constellation. They produced adequate grains. At the day of harvest, they washed feets of their elders, saluted them and served delicious food and proper cloths. Donations were made to needy and helpless. Hence, Dhamma was restored by the people."
        }
    },
    {
        "id": 13,
        "title":"Fes Festival of World Sacred Music",
        "img":"/images/monaco.jpg",
        "DM":"The Fez Festival of World Sacred Music (Festival des Musiques Sacrées du Monde) is an annual music festival that is held for ,..",
        "Detail":
        {   
            "ED":1,
            "id":1,
            "time":"",
            "DS":"The Fez Festival of World Sacred Music (Festival des Musiques Sacrées du Monde) is an annual music festival that is held for a week in Fez, Morocco. It was first held in 1994 and usually held over 10 days in early June. The festival includes concerts, debates, and joint performances of Muslim and Christian devotional music from artists from all over the world.According to Fawzi Sakkali, the former president of the festival, the goal of the event is to highlight Islam's multifaceted nature as a civilization encompassing philosophy, art, urbanism, architecture, and humanism. Furthermore, the festival seeks to foster dialogue between Western and North African scholars, artists, and writers on diverse topics related to the intersection of spirituality, society, and artistic expression and to promote better understanding between cultures and faiths through exposure to sacred music",
            "HIS":"The Fez Festival of World Sacred Music was established in 1994 by Faouzi Skali,[2] a philanthropist and the president of the Spirit of Fez Foundation, with the goal of promoting unity among individuals of all races and religions through spiritual and humanitarian values, inspired by Andalusian principles. Skali believed that music, being a universal language, has the power to communicate with people from all walks of life.The festival was canceled in 2020 and 2021 due to the COVID-19 pandemic.In 2022, allegations arose against the festival organizers for allegedly barring the participation Tibetan musician Loten Namling following purported influence from the Chinese government. Namling, an activist and political refugee who resides in Switzerland, initially received an invitation to perform at the festival's opening event but subsequently received notice that his invitation had been revoked. It is suspected that the Chinese Embassy in Morocco may have intervened with the Moroccan Ministry of Foreign Affairs to prevent Namling from obtaining a visaOver the years, the festival has showcased artists such as Patti Smith, Kadim Al-Sahir, Youssou N'Dour, Sami Yusuf, Salif Keita, Ravi Shankar, Miriam Makeba, Björk and Joan Baez."
        }
    },
    {
        "id": 14,
        "title":"Timket Festival",
        "img":"/images/timket.jpg",
        "DM":"Timket is an Ethiopian Orthodox Tewahedo Church and Eritrean Orthodox Tewahedo Church celebration of Epiphany. It is celebrated on 19 January ,..",
        "Detail":
        {   
            "ED":1,
            "id":2,
            "time":"on 19 January",
            "DS":"Timket is an Ethiopian Orthodox Tewahedo Church and Eritrean Orthodox Tewahedo Church celebration of Epiphany. It is celebrated on 19 January (or 20 in a leap year), corresponding to the 11th day of Terr in the Ge'ez calendar.Timkat celebrates the baptism of Jesus in the River Jordan. This festival is best known for its ritual reenactment of baptism (similar to such reenactments performed by numerous Christian the Holy Land when they visit the Jordan).During the ceremonies of Timkat, the Tabot, a model of the Ark of the Covenant, which is present on every Ethiopian altar (somewhat like the Western altar stone), is reverently wrapped in rich cloth and borne in procession on the head of the priest.[1] The Tabot, which is otherwise rarely seen by the laity, represents the manifestation of Jesus as the Messiah when he came to the Jordan for baptism. The Divine Liturgy is celebrated near a stream or pool early in the morning (around 2 a.m.). Then the nearby body of water is blessed towards dawn and sprinkled on the participants, some of whom enter the water and immerse themselves, symbolically renewing their baptismal vows. But the festival does not end there; Donald N. Levine describes a typical celebration of the early 1960s:",
            "HIS":"By noon on Timqat Day a large crowd has assembled at the ritual site, those who went home for a little sleep having returned, and the holy ark is escorted back to its church in colorful procession and festivities. The clergy, bearing robes and umbrellas of many hues, perform hymns and; the elders march solemnly, attended by middle-aged men singing long-drawn, low-pitched songs and hymns in their own manner; and the children run about with activities and may participate in the services. Dressed up in their finest, the women chatter excitedly on their one real day of freedom in the year. The young braves leap up and down in spirited dances, tirelessly repeating rhythmic songs. This celebration is also registered in UNESCO as an intangible heritage. When the holy ark has been safely restored to its dwelling-place, everyone goes home for feasting. This holiday is one of the greatest holidays if not the greatest.UNESCO inscribed Timkat in 2019 on the Representative List of the Intangible Cultural Heritage of Humanity."
        }
    },
    {
        "id": 15,
        "title":"Saint Patrick's Day",
        "img":"/images/patrick.jpg",
        "DM":"Saint Patrick's Day, or the Feast of Saint Patrick (lit.'the Day of the Festival of Patrick'), is a religious and cultural holiday held on 17 March, the traditional ,..",
        "Detail":
        {   
            "ED":1,
            "id":3,
            "time":"",
            "DS":"Saint Patrick's Day, or the Feast of Saint Patrick (Irish: Lá Fhéile Pádraig, lit. 'the Day of the Festival of Patrick'), is a religious and cultural holiday held on 17 March, the traditional death date of Saint Patrick (c. 385 – c. 461), the foremost patron saint of Ireland.Saint Patrick's Day was made an official Christian feast day in the early 17th century and is observed by the Catholic Church, the Anglican Communion (especially the Church of Ireland),[7] the Eastern Orthodox Church, and the Lutheran Church. The day commemorates Saint Patrick and the arrival of Christianity in Ireland, and, by extension, celebrates the heritage and culture of the Irish in general.[5][8] Celebrations generally involve public parades and festivals, céilithe, and the wearing of green attire or shamrocks.[9] Christians who belong to liturgical denominations also attend church services[8][10] and historically the Lenten restrictions on eating and drinking alcohol were lifted for the day, which has encouraged and propagated the holiday's tradition of alcohol consumptionSaint Patrick's Day is a public holiday in the Republic of Ireland,[13] Northern Ireland,[14] the Canadian province of Newfoundland and Labrador (for provincial government employees), and the British Overseas Territory of Montserrat. It is also widely celebrated in the United Kingdom,[15] Canada, United States, Argentina, Australia, South Africa,[16] and New Zealand, especially amongst Irish diaspora. Saint Patrick's Day is celebrated in more countries than any other national festival.[17] Modern celebrations have been greatly influenced by those of the Irish diaspora, particularly those that developed in North America. However, there has been criticism of Saint Patrick's Day celebrations for having become too commercialised and for fostering negative stereotypes of the Irish people",
            "HIS":"Saint Patrick was a 5th-century Romano-British Christian missionary and Bishop in Ireland. Much of what is known about Saint Patrick comes from the Declaration, which was allegedly written by Patrick himself. It is believed that he was born in Roman Britain in the fourth century, into a wealthy Romano-British family. His father was a deacon and his grandfather was a priest in the Orthodox church. According to the Declaration, at the age of sixteen, he was kidnapped by Irish raiders and taken as a slave to Gaelic Ireland.[19] It says that he spent six years there working as a shepherd and that during this time he found God. The Declaration says that God told Patrick to flee to the coast, where a ship would be waiting to take him home. After making his way home, Patrick went on to become a priest.According to tradition, Patrick returned to Ireland to convert the pagan Irish to Orthodox Christianity. The Declaration says that he spent many years evangelising in the northern half of Ireland and converted thousands.Patrick's efforts were eventually turned into an allegory in which he drove snakes, heathen practices, out of Ireland, despite the fact that actual snakes were not known to inhabit the region.Tradition holds that he died on 17 March and was buried at Downpatrick. Over the following centuries, many legends grew up around Patrick and he became Ireland's foremost saint."
        }
    },
    {
        "id": 16,
        "title":"Hogmanay festival",
        "img":"/images/hogmanay.jpg",
        "DM":"Hogmanay is the Scots word for the last day of the old year and is synonymous with the celebration of the New Year in the Scottish manner.It is normally followed,..",
        "Detail":
        {   
            "ED":1,
            "id":4,
            "time":"Hogmanay takes place every year on the last day of the year – December 31",
            "DS":"Hogmanay is the Scots word for the last day of the old year and is synonymous with the celebration of the New Year in the Scottish manner.It is normally followedby further celebration on the morning of New Year's Day (1 January) and in some cases, 2 January—a Scottish bank holiday.The origins of Hogmanay are unclear, but it may be derived from Norse and Gaelic observances of the winter solstice. Customs vary throughout Scotland, and usually include gift-giving and visiting the homes of friends and neighbours, with special attention given to the first-foot, the first guest of the new year.",
            "HIS":"The etymology of the word is obscure. The earliest proposed etymology comes from the 1693 Scotch Presbyterian Eloquence, which held that the term was a corruption of a presumed Ancient Greek: ἁγία μήνη (hagíā mḗnē) and that this meant holy month.[3][a] The three main modern theories derive it from a French, Norse or Gaelic root.The word is first recorded in a Latin entry in 1443 in the West Riding of Yorkshire as hagnonayse.[4] The first appearance in Scots language came in 1604 in the records of Elgin, as hagmonay.[5] Subsequent 17th-century spellings include Hagmena (1677),[4] Hogmynae night (1681),[4] and Hagmane (1693) in an entry of the Scotch Presbyterian Eloquence.Although Hogmanay is currently the predominant spelling and pronunciation, a number of variant spellings and pronunciations have been recorded, including:"
        }
    },
    {
        "id": 17,
        "title":"Oktoberfest",
        "img":"/images/oktoberfest.jpg",
        "DM":"Oktoberfest ( Bavarian: Wiesn, Oktobafest) is the world's largest Volksfest, featuring a beer festival and a travelling It is held annually in Munich, Bavaria,..",
        "Detail":
        {   
            "ED":1,
            "id":1,
            "time":"2022 date: 17 September: 2023 date: 16 September",
            "DS":"Oktoberfest ( Bavarian: Wiesn, Oktobafest) is the world's largest Volksfest, featuring a beer festival and a travelling carnival. It is held annually in Munich, Bavaria, running from mid- or late-September to around the first Sunday in October, with more than six million international and national visitors attending the event. Locally, it is called d'Wiesn, after the colloquial name for the fairgrounds, Theresienwiese. Oktoberfest is an important part of Bavarian culture, having been held since the year 1810. Other cities across the world also hold Oktoberfest celebrations that are modeled after the original Munich event.During the event, large quantities of Oktoberfest Beer are consumed: in 2014, 7.7 million litres (2,000,000 US gal) were served.[1][2] Visitors also enjoy numerous attractions, such as amusement rides, sidestalls, and games. There is also a wide variety of traditional foods available.Oktoberfest originally took place in the 16-day period leading up to the first Sunday in October. In 1994, this longstanding schedule was modified in response to German reunification. As a result, if the first Sunday in October falls on the 1st or the 2nd, then the festival runs until 3 October (German Unity Day). Thus, the festival now runs for 17 days when the first Sunday is 2 October and 18 days when it is 1 October. In 2010, the festival lasted until the first Monday in October (4 October), to mark the event's bicentennial.",
            "HIS":"Kronprinz Ludwig (1786–1868), later King Ludwig I (reign: 1825–1848), married Princess Therese of Saxe-Hildburghausen on 12 October 1810. The citizens of Munich were invited to attend the festivities held on the fields in front of the city gates to celebrate the royal event. The fields were named Theresienwiese (Theresa's Meadow) in honour of the Crown Princess, and have kept that name ever since, although the locals have abbreviated the name simply to Wiesn.[3] Horse races, in the tradition of the 15th-century Scharlachrennen (Scarlet Race at Karlstor), were held on 18 October to honor the newlyweds. It is widely believed that Andreas Michael Dall'Armi, a major in the National Guard, proposed the idea. However, the origins of the horse races, and Oktoberfest itself, may have stemmed from proposals offered by Franz Baumgartner, a coachman and sergeant in the National Guard. The precise origins of the festival and horse races remain a matter of controversy. However, the decision to repeat the horse races, spectacle, and celebrations in 1811 launched what is now the annual Oktoberfest tradition.The fairground, once outside the city, was chosen due to its natural suitability, which it still holds today. The Sendlinger Hill (today Theresienhohe) was used as a grandstand for 40,000 race spectators. The festival grounds remained undeveloped, except for the king's tent. The tastings of Traiteurs and other wine and beer took place above the visitors in the stands on the hill. Before the race started, a performance was held in homage of the bridegroom and of the royal family in the form of a train of 16 pairs of children dressed in Wittelsbach costumes, and costumes from the nine Bavarian townships and other regions. This was followed by the punishing race with 30 horses on a 3,400 metres (11,200 ft) long racetrack, and concluded with the singing of a student choir. The first horse to cross the finish line belonged to Franz Baumgartner (one of the purported festival initiators). Horse racing champion and Minister of State Maximilian von Montgelas presented Baumgartner with his gold medal."
        }
    },
    {
        "id": 18,
        "title":"The Inti Raymi festival",
        "img":"/images/Inti.jpg",
        "DM":"The Inti Raymi is a traditional religious ceremony of the Inca Empire in honor of the god Inti (Quechua for sun), the most venerated deity in Inca religion.,..",
        "Detail":
        {   
            "ED":1,
            "id":2,
            "time":"",
            "DS":"The Inti Raymi is a traditional religious ceremony of the Inca Empire in honor of the god Inti (Quechua for sun), the most venerated deity in Inca religion. It was the celebration of the winter solstice – the shortest day of the year in terms of the time between sunrise and sunset – and the Inca New Year, when the hours of light would begin to lengthen again. In territories south of the equator, the Gregorian months of June and July are winter months. It is held on June 24During the Inca Empire, the Inti Raymi was the most important of four ceremonies celebrated in Cusco, as related by Inca Garcilaso de la Vega. The celebration took place in the Haukaypata or the main plaza in the city.",
            "HIS":"ccording to chronicler Garcilaso de la Vega, Sapa Inca Pachacuti created the Inti Raymi to celebrate the new year in the Andes of the Southern Hemisphere. The ceremony was also said to symbolize the mythical origin of the Inca people. It lasted for nine days and was filled with colorful dances and processions, as well as animal sacrifices to thank Pachamama and to ensure a good harvest season. The first Inti Raymi was in 1412. The last Inti Raymi with the Inca Emperor's presence was carried out in 1535. After this, the Spanish colonists and their Catholic priests banned the ceremony and other Inca religious practices.In 1944, a historical reconstruction of the Inti Raymi was directed by Faustino Espinoza Navarro and indigenous actors. The first reconstruction was based largely on the chronicles of Garcilaso de la Vega and referred only to the religious ceremony. Since 1944, an annual theatrical representation of the Inti Raymi has been taking place at Saksaywaman on June 24, two kilometers (1.24 miles) from the original site of celebration in central Cusco. It attracts thousands of tourists and local visitors.Inti Raymi is still celebrated in indigenous cultures throughout the Andes. Celebrations involve music, wearing of colorful costumes (most notable the woven aya huma mask), and the sharing of food. In many parts of the Andes though, this celebration has also been connected to the western Catholic festivals of Saint John the Baptist (June 24), which falls a few days after the southern winter solstice (June 21). The celebration today begins at Qorikancha, followed by the Plaza de Armas, and other important sites of the Incan times."
        }
    },
    {
        "id": 19,
        "title":"Navaratri",
        "img":"/images/Navratri.jpg",
        "DM":"Navaratri[a] is an annual Hindu festival observed in honour of the goddess Durga, an aspect of Adi Parashakti, the supreme goddess.It spans over nine nights ,..",
        "Detail":
        {   
            "ED":2,
            "id":3,
            "time":"begins Sunday, October 15 ends Tuesday, October 24",
            "DS":"Navaratri[a] is an annual Hindu festival observed in honour of the goddess Durga, an aspect of Adi Parashakti, the supreme goddess. It spans over nine nights (and ten days), first in the month of Chaitra (March/April of the Gregorian calendar), and again in the month of Ashvin (September–October).[2][3] It is observed for different reasons and celebrated differently in various parts of the Hindu Indian cultural sphere.[2][4] Theoretically, there are four seasonal Navaratri. However, in practice, it is the post-monsoon autumn festival called Sharada Navaratri.",
            "HIS":"Sharada Navaratri is the most celebrated of the four Navaratri, named after Sharada which means autumn. It commences on the first day (pratipada) of the bright fortnight of the lunar month of Ashvini.[13] The festival is celebrated for nine nights once every year during this month, which typically falls in the Gregorian months of September and October. The exact dates of the festival are determined according to the Hindu lunisolar calendar, and sometimes the festival may be held for a day more or a day less depending on the adjustments for sun and moon movements and the leap year.[2][6][11] In many regions, the festival falls after the autumn harvest, and in others, during harvest.The festivities extend beyond goddess Durga and various other goddesses such as Saraswati and Lakshmi. Deities such as Ganesha, Kartikeya, Shiva, and Parvati are regionally revered. For example, a notable pan-Hindu tradition during Navaratri is the adoration of Saraswati, the Hindu goddess of knowledge, learning, music, and arts, through Ayudha Puja.[15] On this day, which typically falls on the ninth day of Navaratri, peace and knowledge is celebrated. Warriors thank, decorate, and worship their weapons, offering prayers to Saraswati.[16] Musicians upkeep, play, and pray their musical instruments. Farmers, carpenters, smiths, pottery makers, shopkeepers, and all sorts of tradespeople similarly decorate and worship their equipment, machinery, and tools of trade. Students visit their teachers, express respect, and seek their blessings.[15][17] This tradition is particularly strong in South India, but is observed elsewhere too.Chaitra Navaratri, also called Vasantha Navaratri, is the second most celebrated Navaratri, named after vasanta which means spring. It is observed during the lunar month of Chaitra (March–April). The festival is devoted to goddess Durga, whose nine forms are worshipped on nine days. The last day is also Rama Navami, the birthday of Rama. For this reason, it is also called Rama Navaratri by some people.In many regions, the festival falls after spring harvest, and in others, during harvest. It also marks the first day of the Hindu lunisolar calendar, also known as the Hindu Lunar New Year, according to the Vikram Samvat calendar.Magha Navaratri is observed during the lunar month of Magha (January–February). This Navaratri is also known as Gupt (secret) Navaratri. The fifth day of this festival is often independently observed as Vasant Panchami or Basant Panchami, the official start of spring in the Hindu tradition, wherein goddess Saraswati is revered through arts, music, writing, and kite flying. In some regions, the Hindu god of love, Kama is revered.[21][22] Magha Navaratri is observed regionally or by individuals.Ashada Navaratri, also known as Gupta Navaratri, is observed during the lunar month of Ashadha (June–July), during the start of the monsoon season.[24] Ashada Navaratri is observed regionally or by individuals."
        }
    },
    {
        "id": 20,
        "title":"Krishna Janmashtami",
        "img":"/images/Janmashtami.jpg",
        "DM":"Krishna Janmashtami also known simply as Krishnashtami, Janmashtami, or Gokulashtami, is an annual Hindu festival that celebrates the birth of Krishna,..",
        "Detail":
        {   
            "ED":2,
            "id":4,
            "time":"Krishna Janmashtami 2024 Monday, August 26 ",
            "DS":"Krishna Janmashtami also known simply as Krishnashtami, Janmashtami, or Gokulashtami, is an annual Hindu festival that celebrates the birth of Krishna, the eighth avatar of Vishnu. In certain Hindu texts, such as the Gita Govinda, Krishna has been identified as supreme God and the source of all avatars.[5] Krishna's birth is celebrated and observed on the eighth day (Ashtami) of the dark fortnight (Krishna Paksha) in Shravana Masa (according to the amanta tradition) or Bhadrapada Masa (according to the purnimanta tradition). This overlaps with August or September of the Gregorian calendar.It is an important festival, particularly in the Vaishnavism tradition of Hinduism.[6] The celebratory customs associated with Janmashtami include a celebration festival, reading and recitation of religious texts, dance and enactments of the life of Krishna according to the Bhagavata Purana, devotional singing till midnight (the time of Krishna's birth), and fasting (upavasa), amongst other things.[7] It is widely celebrated across India and abroad.",
            "HIS":"Information about Krishna's life is noted in the Mahabharata, the Puranas, and Bhagavata Purana. Krishna is the eighth son of Devaki (mother) and Vasudeva (father).[5] Surrounding the time of his birth, persecution was rampant, freedoms were being denied, and King Kamsa's life was threatened.[13] Krishna was born within a prison in Mathura, India where his parents were constrained by his uncle, Kamsa.[5] During Devaki's wedding, Kamsa was warned by a celestial voice that Devaki's eighth son would be the cause of his death.[5] In an effort to defy this prophesy, Kamsa imprisoned Devaki and her husband and promptly killed the first six of her newborns after their birth.[5] The guards responsible for keeping watch over Devaki's cell fell asleep and the cell doors were miraculously opened at the time of Krishna's birth.[5] These events allowed Vasudeva to send Krishna across the Yamuna River to his foster parents, Yashoda (mother) and Nanda (father).[5] This legend is celebrated on Janmashtami by people keeping fasts, singing devotional songs of love for Krishna, and keeping a vigil into the night.Throughout Krishna's childhood and young adult life, Balarama, Krishna's half-brother, was a constant companion for him. Balarama joined Krishna in the major events that are celebrated in Vraja, Brindavan, Dravarka, and Mathura such as stealing butter, chasing calves, playing in the cow pens, and participating in wrestling matches."
        }
    },

    {
        "id": 21,
        "title":"Setsubun festival",
        "img":"/images/setsubun.jpg",
        "DM":"Setsubun (節分) is the day before the beginning of spring in the old calendar in Japan.[1][2] The name literally means 'seasonal division', referring to the day just before ,..",
        "Detail":
        {   
            "ED":2,
            "id":1,
            "time":"Saturday, February 3 in 2024",
            "DS":"Setsubun (節分) is the day before the beginning of spring in the old calendar in Japan.[1][2] The name literally means 'seasonal division', referring to the day just before the first day of spring in the traditional calendar, known as Setsubun; though previously referring to a wider range of possible dates, Setsubun is now typically held on February 3 (in 2021 it was on 2nd February),[3] with the day after – the first day of spring in the old calendar – known as Risshun (立春). Both Setsubun and Risshun are celebrated yearly as part of the Spring Festival (Haru matsuri (春祭)) in Japan.[4] In its association with the Lunar New Year, Setsubun, though not the official New Year, was thought of as similar in its ritual and cultural associations of 'cleansing' the previous year as the beginning of the new season of spring. Setsubun was accompanied by a number of rituals and traditions held at various levels to drive away the previous year's bad fortunes and evil spirits for the year to come.",
            "HIS":"Setsubun has its origins in tsuina (追儺), a Chinese custom introduced to Japan in the 8th century.[2] It was quite different from the Setsubun known today. According to the Japanese history book Shoku Nihongi, tsuina was first held in Japan in 706, and it was an event to ward off evil spirits held at the court on the last day of the year according to the lunar-solar calendar. At that time, tsuina was an event to drive away evil spirits that brought misfortune and disease by decorating each gate of the palace with clay figures of cows and children and using peach branches and walking sticksThe custom of Setsubun as we know it today began in the Muromachi period (1336–1573). Every household of the aristocracy and samurai class threw beans from their houses into the open air. The [[Ainōshō]] [ja],[8] a dictionary compiled during the Muromachi period, states that the practice of bean-throwing during Setsubun originated from a legend in the 10th century, during the reign of Emperor Uda, that a monk on Mt. Kurama escaped misfortune by blinding oni with roasted beans. The Japanese word for bean, 豆, is pronounced mame, which can be written as 'devil's eye' (魔目), and some believe that the pronunciation is similar to that of mametsu (魔滅), meaning 'to destroy the devil', which is why people began throwing beans during Setsubun.From the Edo period (1603–1867), the custom of throwing beans at Shinto shrines, Buddhist temples, and homes of ordinary people spread throughout Japan as an event or festival to drive away evil spirits during Setsubun. It was also during this period that the custom of tying roasted sardine heads to holly sprig to decorate the gates of houses during Setsubun began. This custom was intended to scare away oni with the thorns of the holly leaves and the smell of the roasted sardines. The original form of this custom is recorded in the Tosa Nikki, compiled in 934 during the Heian period (794–1185). The diary describes a Shinto shimenawa (sacred rope) that was hung on the gate of a house during the New Year's holiday to mark the boundary of purification, and that a mullet head pierced with a sprig of holly was attached to the shimenawa.The custom of eating ehōmaki (恵方巻) on Setsubun began in the geisha districts from the Edo period to the Meiji period. Ehōmaki is a special makizushi (sushi roll) eaten on Setsubun. On Setsubun, people face the most auspicious direction of the year and eat the whole ehōmaki, an uncut sushi roll, to pray for prosperity and happiness for the year. It is believed that it was originally called simply marukaburi zushi (丸かぶり寿司) or futomaki zushi (太巻き寿司). The name ehōmaki may have spread throughout Japan in 1989, when a Japanese convenience store chain renamed it ehōmaki and began selling it"
        }
    },
    {
        "id": 22,
        "title":"Pentecost festival",
        "img":"/images/HOLY.jpg",
        "DM":"Pentecost (also called Whit Sunday, Whitsunday or Whitsun) is a Christian holiday which takes place on the 50th day[a] (the seventh Sunday) after Easter Sunday,..",
        "Detail":
        {   
            "ED":2,
            "id":2,
            "time":"Sunday, May 19 in 2024",
            "DS":"Pentecost (also called Whit Sunday, Whitsunday or Whitsun) is a Christian holiday which takes place on the 50th day[a] (the seventh Sunday) after Easter Sunday.[1] It commemorates the descent of the Holy Spirit upon the Virgin Mary and the Apostles of Jesus Christ while they were in Jerusalem celebrating the Feast of Weeks, as described in the Acts of the Apostles (Acts 2:1–31).Pentecost is one of the Great feasts in the Eastern Orthodox Church, a Solemnity in the Roman Rite of the Catholic Church, a Festival in the Lutheran Churches, and a Principal Feast in the Anglican Communion. Many Christian denominations provide a special liturgy for this holy celebration. Since its date depends on the date of Easter, Pentecost is a moveable feast. The Monday after Pentecost is a legal holiday in many European, African and Caribbean countries.",
            "HIS":"The term Pentecost comes from the Greek Πεντηκοστή (Pentēkostē), meaning fiftieth. It refers to the Jewish festival of Shavuot celebrated on the fiftieth day after Passover. It is also known as the Feast of Weeks and the Feast of 50 days in rabbinic tradition.The Septuagint uses the term Pentēkostē to refer to the Feast of Pentecost twice; in the Book of Tobit and 2 Maccabees, which for Catholics are part of the Bible but for Protestants are deuterocanonical/apocryphal books in the Bible.[7][8][9] The term Pentecost appears in the Septuagint as one of the names for the Festival of WeeksThe Septuagint translators also used the word in two other senses: to signify the year of Jubilee (Leviticus 25:10)[11][7] an event which occurs every 50th year, and in several passages of chronology as an ordinal number.[ii] The term has also been used in the literature of Hellenistic Judaism by Philo of Alexandria and Josephus.The native English word Whitsunday, White Sunday (Old English: Hwita Sunnandæg), probably derives from the white robes worn by the newly baptized on Pentecost. The weekend or week including Pentecost are also called Whitsun or Whitsuntide, which arose from redividing Whitsunday as Whitsun day. The other days of the week are sometimes called Whit Monday, Whit Tuesday, and so on."
        }
    },
    {
        "id": 23,
        "title":"Trang An traditional festival",
        "img":"/images/muslims.jpg",
        "DM":"also spelled Ramazan, Ramzan, Ramadhan or Ramathan) is the ninth month of the Islamic calendar,observed by ,..",
        "Detail":
        {   
            "ED":2,
            "id":3,
            "time":"begins Sunday, March 10 ends Monday, April 8 in 2024 ",
            "DS":"also spelled Ramazan, Ramzan, Ramadhan or Ramathan) is the ninth month of the Islamic calendar,observed by  Muslims worldwide as a month of fasting (sawm), prayer, reflection, and community.[10] A commemoration of Muhammad's first revelation,[11] the annual observance of Ramadan is regarded as one of the Five Pillars of Islam[12] and lasts twenty-nine to thirty days, from one sighting of the crescent moon to the next.Fasting from dawn to sunset is fard (obligatory) for all adult Muslims who are not acutely or chronically ill, travelling, elderly, breastfeeding, diabetic, or menstruating.[15] The predawn meal is referred to as suhur, and the nightly feast that breaks the fast is called iftar.[16][17] Although fatwas have been issued declaring that Muslims who live in regions with a midnight sun or polar night should follow the timetable of Mecca,[18] it is common practice to follow the timetable of the closest country in which night can be distinguished from day.The spiritual rewards (thawab) of fasting are believed to be multiplied during Ramadan.[22] Accordingly, during the hours of fasting Muslims refrain not only from food and drink, but also tobacco products, sexual relations, and sinful behavior, devoting themselves instead to salat (prayer) and study of the Quran.",
            "HIS":"Muslims hold that all scripture was revealed during Ramadan, the scrolls of Abraham, Torah, Psalms, Gospel, and Quran having been handed down on the first, sixth, twelfth, thirteenth (in some sources, eighteenth)[42] and twenty-fourth Ramadans,respectivelyMuhammed is said to have received his first quranic revelation on Laylat al-Qadr, one of five odd-numbered nights that fall during the last ten days of Ramadan.Although Muslims were first commanded to fast in the second year of Hijra (624 CE),[43] they believe that the practice of fasting is not in fact an innovation of monotheism[45] but rather has always been necessary for believers to attain taqwa (the fear of God).They point to the fact that the pre-Islamic pagans of Mecca fasted on the tenth day of Muharram to expiate sin and avoid drought Philip Jenkins argues that the observance of Ramadan fasting grew out of the strict Lenten discipline of the Syrian Churches, a postulation corroborated by other scholars, including theologian Paul-Gordon Chandler,[48][49] but disputed by some Muslim academics."
        }
    },
    {
        "id": 24,
        "title":"Chinese New Year",
        "img":"/images/chin.jpg",
        "DM":"Chinese New Year is the festival that celebrates the beginning of a new year on the traditional lunisolar Chinese calendar. In Chinese, the festival ,..",
        "Detail":
        {   
            "ED":2,
            "id":4,
            "time":"Saturday, February 10 , in 2024",
            "DS":"Chinese New Year is the festival that celebrates the beginning of a new year on the traditional lunisolar Chinese calendar. In Chinese, the festival is commonly referred to as the Spring Festival  as the spring season in the lunisolar calendar traditionally starts with lichun, the first of the twenty-four solar terms which the festival celebrates around the time of the Chinese New Year.[3] Marking the end of winter and the beginning of the spring season, observances traditionally take place from Chinese New Year's Eve, the evening preceding the first day of the year, to the Lantern Festival, held on the 15th day of the year. The first day of Chinese New Year begins on the new moon that appears between 21 January and 20 February.Chinese New Year is one of the most important holidays in Chinese culture, and has strongly influenced Lunar New Year celebrations of its 56 ethnic groups, such as the Losar of Tibet (Tibetan: ལོ་གསར་), and of China's neighbours, including the Korean New Year (Korean: 설날; RR: Seollal), and the Tết of Vietnam,[5] as well as in Okinawa.[6] It is also celebrated worldwide in regions and countries that house significant Overseas Chinese or Sinophone populations, especially in Southeast Asia. These include Brunei, Cambodia, Indonesia, Malaysia, Myanmar,[7] the Philippines,[8] Singapore,[9] Thailand, and Vietnam. It is also prominent beyond Asia, especially in Australia, Canada, Mauritius,[10] New Zealand, Peru,[11] South Africa, the United Kingdom, and the United States, as well as various European countries.The Chinese New Year is associated with several myths and customs. The festival was traditionally a time to honour deities as well as ancestors.[15] Within China, regional customs and traditions concerning the celebration of the New Year vary widely,[16] and the evening preceding the New Year's Day is frequently regarded as an occasion for Chinese families to gather for the annual reunion dinner. It is also a tradition for every family to thoroughly clean their house, in order to sweep away any ill fortune and to make way for incoming good luck. Another custom is the decoration of windows and doors with red paper-cuts and couplets. Popular themes among these paper-cuts and couplets include good fortune or happiness, wealth, and longevity. Other activities include lighting firecrackers and giving money in red envelopes.",
            "HIS":"Before the new year celebration was established, ancient Chinese gathered and celebrated the end of harvest in autumn. However, this was not the Mid-Autumn Festival, during which Chinese gathered with family to worship the Moon. In the Classic of Poetry, a poem written during Western Zhou (1045 BC – 771 BC) by an anonymous farmer, described the traditions of celebrating the 10th month of the ancient solar calendar, which was in autumn.[21] According to the poem, during this time people clean millet-stack sites, toast guests with mijiu (rice wine), kill lambs and cook their meat, go to their masters' home, toast the master, and cheer the prospect of living long together. The 10th-month celebration is believed to be one of the prototypes of Chinese New Year.[22] The records of the first Chinese new year celebration can be traced to the Warring States period (475 BC – 221 AD). In the Lüshi Chunqiu, in Qin state an exorcism ritual to expel illness, called Big Nuo (大儺), was recorded as being carried out on the last day of the year.[23][24] Later, Qin unified China, and the Qin dynasty was founded; and the ritual spread. It evolved into the practice of cleaning one's house thoroughly in the days preceding Chinese New Year.The first mention of celebrating at the start of a new year was recorded during the Han dynasty (202 BC – 220 AD). In the book Simin Yueling (四民月令), written by the Eastern Han agronomist Cui Shi (崔寔), a celebration was described: The starting day of the first month, is called Zheng Ri. I bring my wife and children, to worship ancestors and commemorate my father. Later he wrote: Children, wife, grandchildren, and great-grandchildren all serve pepper wine to their parents, make their toast, and wish their parents good health. It's a thriving view.The practice of worshipping ancestors on New Year's Eve is maintained by Chinese people to this day.Han Chinese also started the custom of visiting acquaintances' homes and wishing each other a happy new year. In Book of the Later Han, volume 27, a county officer was recorded as going to his prefect's house with a government secretary, toasting the prefect, and praising the prefect's merit.During the Jin dynasty (266 – 420 AD), people started the New Year's Eve tradition of all-night revelry called shousui (守歲). It was described in Western Jin general Zhou Chu's article Fengtu Ji (風土記 “Notes on Local Conditions”): At the ending of a year, people gift and wish each other, calling it Kuisui (饋歲 “gift time”); people invited others with drinks and food, calling it Biesui (別歲 “others time”); on New Year's Eve, people stayed up all night until sunrise, calling it Shousui (守歲 “guard the year”). The article used the word chu xi (除夕) to indicate New Year's Eve, and the name is still used until this day."
        }
    },
    {
        "id": 25,
        "title":"Easter festival",
        "img":"/images/easter.jpg",
        "DM":" is a Christian festival and cultural holiday commemorating the resurrection of Jesus from the dead, described in the New Testament,..",
        "Detail":
        {   
            "ED":2,
            "id":1,
            "time":"",
            "DS":" is a Christian festival and cultural holiday commemorating the resurrection of Jesus from the dead, described in the New Testament as having occurred on the third day of his burial following his crucifixion by the Romans at Calvary c. 30 AD.[10][11] It is the culmination of the Passion of Jesus Christ, preceded by Lent (or Great Lent), a 40-day period of fasting, prayer, and penance.Easter-observing Christians commonly refer to the week before Easter as Holy Week, which in Western Christianity begins on Palm Sunday (marking the entrance of Jesus in Jerusalem), includes Spy Wednesday (on which the betrayal of Jesus is mourned),[12] and contains the days of the Easter Triduum including Maundy Thursday, commemorating the Maundy and Last Supper,[13][14] as well as Good Friday, commemorating the crucifixion and death of Jesus.[15] In Eastern Christianity, the same days and events are commemorated with the names of days all starting with Holy or Holy and Great; and Easter itself might be called Great and Holy Pascha, Easter Sunday, Pascha or Sunday of Pascha. In Western Christianity, Eastertide, or the Easter Season, begins on Easter Sunday and lasts seven weeks, ending with the coming of the 50th day, Pentecost Sunday. In Eastern Christianity, the Paschal season ends with Pentecost as well, but the leave-taking of the Great Feast of Pascha is on the 39th day, the day before the Feast of the Ascension.Easter and its related holidays are moveable feasts, not falling on a fixed date; its date is computed based on a lunisolar calendar (solar year plus Moon phase) similar to the Hebrew calendar. The First Council of Nicaea (325) established only two rules, namely independence from the Hebrew calendar and worldwide uniformity. No details for the computation were specified; these were worked out in practice, a process that took centuries and generated a number of controversies. It has come to be the first Sunday after the ecclesiastical full moon that occurs on or soonest after 21 March.[16] Even if calculated on the basis of the Gregorian calendar, the date of that full moon sometimes differs from that of the astronomical first full moon after the March equinox.",
            "HIS":"The modern English term Easter, cognate with modern Dutch ooster and German Ostern, developed from an Old English word that usually appears in the form Ēastrun, Ēastron, or Ēastran; but also as Ēastru, Ēastro; and Ēastre or Ēostre.[nb 4] Bede provides the only documentary source for the etymology of the word, in his eighth-century The Reckoning of Time. He wrote that Ēosturmōnaþ (Old English for 'Month of Ēostre', translated in Bede's time as Paschal month) was an English month, corresponding to April, which he says was once called after a goddess of theirs named Ēostre, in whose honour feasts were celebrated in that month.In Latin and Greek, the Christian celebration was, and still is, called Pascha (Greek: Πάσχα), a word derived from Aramaic פסחא (Paskha), cognate to the Hebrew פֶּסַח (Pesach). The word originally denoted the Jewish festival known in English as Passover, commemorating the Jewish Exodus from slavery in Egypt.As early as the 50s of the 1st century, Paul the Apostle, writing from Ephesus to the Christians in Corinth,[38] applied the term to Christ, and it is unlikely that the Ephesian and Corinthian Christians were the first to hear Exodus 12 interpreted as speaking about the death of Jesus, not just about the Jewish Passover ritual.[39] In most languages, Germanic languages such as English being exceptions, the feast is known by names derived from the Greek and Latin Pascha.[7][40] Pascha is also a name by which Jesus himself is remembered in the Orthodox Church, especially in connection with his resurrection and with the season of its celebration.[41] Others call the holiday Resurrection Sunday or Resurrection Day, after the Greek Ἀνάστασις, Anastasis, 'Resurrection' day."
        }
    },
    {
        "id": 26,
        "title":"Hajj festival",
        "img":"/images/haj.jpg",
        "DM":"Hajj is an annual Islamic pilgrimage to Mecca, Saudi Arabia,[2] the holiest city for Muslims. Hajj is a mandatory religious duty for Muslims that must be carried out at,..",
        "Detail":
        {   
            "ED":2,
            "id":2,
            "time":"",
            "DS":"Hajj is an annual Islamic pilgrimage to Mecca, Saudi Arabia,[2] the holiest city for Muslims. Hajj is a mandatory religious duty for Muslims that must be carried out at least once in their lifetime by all adult Muslims who are physically and financially capable of undertaking the journey, and of supporting their family during their absence from home.In Islamic terminology, Hajj is a pilgrimage made to the Kaaba, the House of Allah, in the sacred city of Mecca in Saudi Arabia. It is one of the Five Pillars of Islam, alongside Shahadah (oath that one believes there is no god but Allah (God)),[6] salat (prayer), zakat (almsgiving) and sawm (fasting of Ramadan). The Hajj is an annual practice when Muslim brotherhood is on display and their solidarity with fellow Muslim people, and submission to God (Allah) is fulfilled.[7][8] The word Hajj means pilgrimage made to the Kaaba, a long pious journey taken by Muslims to cleanse their souls of all worldly sins, which connotes both the outward act of a journey after death and the inward act of good intentions.[9] The rites of pilgrimage are performed over five to six days, extending from the 8th to the 12th or 13th[10] of Dhu al-Hijjah, the last month of the Islamic calendar.[11] Because the Islamic calendar is lunar and the Islamic year is about eleven days shorter than the Gregorian year, the Gregorian date of Hajj changes from year to year. In 2023 AD (1444 AH), Dhu al-Hijjah extends from 19 June to 18 July.The Hajj is associated with the life of Islamic prophet Muhammad from the 7th century AD, but the ritual of pilgrimage to Mecca stated in Muslim sources stretches back to the time of Abraham. During Hajj, pilgrims join processions of millions of Muslim people, who simultaneously converge on Mecca for the week of the Hajj, and perform a series of pre-Islamic rituals (reformed by Muhammad): each person wears a single piece of unstitched white clothing (Ihram), walks counter-clockwise seven times around the Kaaba (a cube-shaped building and the direction of prayer for Muslims), kiss the black stone mounted on the corner wall of Kaaba, walks briskly back and forth between the hills of Safa and Marwah seven times, then drinks from the Zamzam Well, goes to the plains of Mount Arafat to stand in vigil, spends a night in the plain of Muzdalifa, and performs symbolic Stoning of the Devil by throwing stones at three pillars. After the sacrifice of cattle (which can be accomplished by using a voucher), the pilgrims then are required to either shave or trim their heads (if male) or trim the ends of their hair (if female). A celebration of the four-day global festival of Eid al-Adha proceeds afterwards.[12][13][14] Muslims may also undertake an Umrah (Arabic: عُمرَة), or lesser pilgrimage to Mecca at other times of the year. However, the Umrah is not a substitute for the Hajj and Muslims are still obligated to perform the Hajj at some other point in their lifetime if they have the means to do so.",
            "HIS":"The present pattern of Hajj was established by Muhammad.[23] However, according to the Quran, elements of Hajj trace back to the time of Abraham. According to Islamic tradition, Abraham was ordered by God to leave his wife Hajar and his son Ishmael alone in the desert of ancient Mecca. In search of water, Hajar desperately ran seven times between the two hills of Safa and Marwah but found none. Returning in despair to Ishmael, she saw the baby scratching the ground with his leg and a water fountain sprang forth underneath his foot.[24] Later, Abraham was commanded to build the Kaaba (which he did with the help of Ishmael) and to invite people to perform pilgrimage there.In pre-Islamic Arabia, a time known as Age of Ignorance, the Kaaba became surrounded by pagan idols.[26] In 630 AD, Muhammad led his followers from Medina to Mecca, cleansed the Kaaba by destroying all the pagan idols, and then consecrated the building to God.[27] In 632 AD, Muhammad performed his only and last pilgrimage with a large number of followers, and instructed them on the rites of Hajj.[28] It was from this point that Hajj became one of the five pillars of Islam.During medieval times, pilgrims would gather in the big cities of Syria, Egypt, and Iraq to go to Mecca in groups and caravans comprising tens of thousands of pilgrims,[29] often under state patronage.[30] Hajj caravans, particularly with the advent of the Mamluk Sultanate and its successor, the Ottoman Empire, were escorted by a military force accompanied by physicians under the command of an amir al-hajj.[31][32] This was done to protect the caravan from Bedouin robbers or natural hazards,[n 2][31][32] and to ensure that the pilgrims were supplied with the necessary provisions.[31] Muslim travelers like Ibn Jubayr and Ibn Battuta have recorded detailed accounts of Hajj journeys in medieval times.[33] The caravans followed well-established routes called in Arabic darb al-hajj, lit. pilgrimage road, which usually followed ancient routes such as the King's Highway."
        }
    },
    {
        "id": 27,
        "title":"Christmas festival",
        "img":"/images/chritmas.jpg",
        "DM":"Christmas is an annual festival commemorating the birth of Jesus Christ, observed primarily on December 25[a] as a religious and cultural celebration,..",
        "Detail":
        {   
            "ED":2,
            "id":3,
            "time":"",
            "DS":"Christmas is an annual festival commemorating the birth of Jesus Christ, observed primarily on December 25[a] as a religious and cultural celebration among billions of people around the world.A feast central to the Christian liturgical year, it is preceded by the season of Advent or the Nativity Fast and initiates the season of Christmastide, which historically in the West lasts twelve days and culminates on Twelfth Night.[5] Christmas Day is a public holiday in many countries,[6][7][8] is celebrated religiously by a majority of Christians,[9] as well as culturally by many non-Christians,[1][10] and forms an integral part of the holiday season organized around it.The traditional Christmas narrative recounted in the New Testament, known as the Nativity of Jesus, says that Jesus was born in Bethlehem, in accordance with messianic prophecies.[11] When Joseph and Mary arrived in the city, the inn had no room and so they were offered a stable where the Christ Child was soon born, with angels proclaiming this news to shepherds who then spread the word.There are different hypotheses regarding the date of Jesus' birth and in the early fourth century, the church fixed the date as December 25.[b][13][14][15] This corresponds to the traditional date of the winter solstice on the Roman calendar.[16] It is exactly nine months after Annunciation on March 25, also the date of the spring equinox.[17] Most Christians celebrate on December 25 in the Gregorian calendar, which has been adopted almost universally in the civil calendars used in countries throughout the world. However, part of the Eastern Christian Churches celebrate Christmas on December 25 of the older Julian calendar, which currently corresponds to January 7 in the Gregorian calendar. For Christians, believing that God came into the world in the form of man to atone for the sins of humanity, rather than knowing Jesus' exact birth date, is considered to be the primary purpose in celebrating Christmas.The celebratory customs associated in various countries with Christmas have a mix of pre-Christian, Christian, and secular themes and origins.[21][22] Popular modern customs of the holiday include gift giving; completing an Advent calendar or Advent wreath; Christmas music and caroling; viewing a Nativity play; an exchange of Christmas cards; church services; a special meal; and the display of various Christmas decorations, including Christmas trees, Christmas lights, nativity scenes, garlands, wreaths, mistletoe, and holly. In addition, several closely related and often interchangeable figures, known as Santa Claus, Father Christmas, Saint Nicholas, and Christkind, are associated with bringing gifts to children during the Christmas season and have their own body of traditions and lore.[23] Because gift-giving and many other aspects of the Christmas festival involve heightened economic activity, the holiday has become a significant event and a key sales period for retailers and businesses. Over the past few centuries, Christmas has had a steadily growing economic effect in many regions of the world.",
            "HIS":"The nativity sequences included in the Gospels of Matthew and Luke prompted early Christian writers to suggest various dates for the anniversary.At the time of the 2nd century, the earliest church records indicate that Christians were remembering and celebrating the birth of the Lord, an observance [that] sprang up organically from the authentic devotion of ordinary believers. Though Christmas did not appear on the lists of festivals given by the early Christian writers Irenaeus and Tertullian,[24] the Chronograph of 354 records that a Christmas celebration took place in Rome eight days before the calends of January.[42] This section was written in AD 336, during the brief pontificate of Pope Mark.In the East, the birth of Jesus was celebrated in connection with the Epiphany on January 6.[44][45] This holiday was not primarily about the nativity, but rather the baptism of Jesus.[46] Christmas was promoted in the East as part of the revival of Orthodox Christianity that followed the death of the pro-Arian Emperor Valens at the Battle of Adrianople in 378. The feast was introduced in Constantinople in 379, in Antioch by John Chrysostom towards the end of the fourth century,[45] probably in 388, and in Alexandria in the following century.[47] The presence of hymns for the feast in the Georgian Iadgari demonstrates that it was celebrated in Jerusalem by the 6th century at the latest.Various factors contributed to the selection of December 25 as a date of celebration: it was nine months after the date linked to the conception of Jesus—March 25, which also marked the vernal equinox (celebrated as the Feast of the Annunciation) and it was the date of the winter solstice on the Roman calendar.[17] The early Church Fathers John Chrysostom, Augustine of Hippo, and Jerome attested to 25 December as the date of Christmas.[41] The primitive Church connected Jesus to the Sun through the use of such phrases as Sun of righteousness. The early Christian writer Lactantius wrote the east is attached to God because he is the source of light and the illuminator of the world and he makes us rise toward eternal life. It is for this reason that the early Christians established the direction of prayer as being eastward, towards the rising sun.[41] In the Roman Empire, in which many Christians resided, the winter solstice was marked on December 25In 567, the Council of Tours put in place the season of Christmastide, proclaiming the twelve days from Christmas to Epiphany as a sacred and festive season, and established the duty of Advent fasting in preparation for the feast.This was done in order to solve the administrative problem for the Roman Empire as it tried to coordinate the solar Julian calendar with the lunar calendars of its provinces in the east.Christmas played a role in the Arian controversy of the fourth century. After this controversy ran its course, the prominence of the holiday declined for a few centuries. The feast regained prominence after 800 when Charlemagne was crowned emperor on Christmas Day"
        }
    },
    {
        "id": 28,
        "title":"Vesak festival",
        "img":"/images/vesak.jpg",
        "DM":"Vesak also known as Buddha Jayanti,[8] Buddha Purnima,[9] Buddha Day, and Phật Đản, is a holiday traditionally observed by Buddhists in South Asia ,..",
        "Detail":
        {   
            "ED":2,
            "id":4,
            "time":"",
            "DS":"Vesak also known as Buddha Jayanti,[8] Buddha Purnima,[9] Buddha Day, and Phật Đản, is a holiday traditionally observed by Buddhists in South Asia and Southeast Asia, as well as Tibet and Mongolia.[10] It is the most important Buddhist festival. The festival commemorates the birth, enlightenment (Nibbāna), and passing (Parinirvāna) of Gautama Buddha in Theravada, Tibetan Buddhism and Navayana The name Vesak is derived from the Pali term vesākha or Sanskrit vaiśākha for the lunar month of Vaisakha, which is considered the month of Buddha's birth.[12] In Mahayana Buddhist traditions, the holiday is known by its Sanskrit name (Vaiśākha) and derived variants of it.In the East Asian tradition, a celebration of Buddha's Birthday typically occurs around the traditional timing of Vesak, while the Buddha's awakening and passing away are celebrated as separate holidays that occur at other times in the calendar as Bodhi Day and Nibbāna Day. In the South Asian tradition, where Vesak is celebrated on the full moon day of the Vaisakha month, the Vesak day marks the birth, enlightenment, and the ultimate passing away of the Buddha.",
            "HIS":"Although Buddhist festivals have centuries-old tradition, the first conference of the World Fellowship of Buddhists held in Sri Lanka in 1950 formalized the decision to celebrate Vesak as the Buddha's birthday across multiple Buddhist countries. The resolution that was adopted at the World Conference reads as follows:That this Conference of the World Fellowship of Buddhists, while recording its appreciation of the gracious act of His Majesty, the Maharaja of Nepal in making the full-moon day of Vesak a Public Holiday in Nepal, earnestly requests the Heads of Governments of all countries in which large or small number of Buddhists are to be found, to take steps to make the full-moon day in the month of May a Public Holiday in honour of the Buddha, who is universally acclaimed as one of the greatest benefactors of Humanity.On Vesak Day, Buddhists all over the world commemorate events of significance to Buddhists of all traditions: The birth, enlightenment and the passing away of Gautama Buddha. As Buddhism spread from India it was assimilated into many foreign cultures, and consequently Vesak is celebrated in many different ways all over the world. In India, Vaishakh Purnima day is also known as Buddha Jayanti day and has been traditionally accepted as Buddha's birth day.In 2000, the United Nations (UN) resolved to internationally observe the day of Vesak at its headquarters and offices"
        }
    },
    {
        "id": 29,
        "title":"Māgha Pūjā day",
        "img":"/images/magha.jpg",
        "DM":"Māgha Pūjā (also written as Makha Bucha Day) is a Buddhist festival celebrated on the full moon day of the third lunar month[7] in Cambodia, Laos, Thailand,..",
        "Detail":
        {   
            "ED":2,
            "id":1,
            "time":"",
            "DS":"Māgha Pūjā (also written as Makha Bucha Day) is a Buddhist festival celebrated on the full moon day of the third lunar month[7] in Cambodia, Laos, Thailand, Sri Lanka and on the full moon day of Tabaung in Myanmar. It is the second most important Buddhist festival after Vesak; it celebrates a gathering that was held between the Buddha and 1,250 of his first disciples, which, according to tradition, preceded the custom of periodic recitation of discipline by monks. On the day, Buddhists celebrate the creation of an ideal and exemplary community, which is why it is sometimes called Saṅgha Day, the Saṅgha referring to the Buddhist community, and for some Buddhist schools this is specifically the monastic community.[8][1] In Thailand, the Pāli term Māgha-pūraṇamī is also used for the celebration, meaning 'to honor on the full moon of the third lunar month'.[9] Finally, some authors referred to the day as the Buddhist All Saints Day.In pre-modern times, Māgha Pūjā has been celebrated by some Southeast Asian communities. But it became widely popular in the modern period, when it was instituted in Thailand by King Rama IV in the mid-19th century. From Thailand, it spread to other South and Southeast Asian countries. Presently, it is a public holiday in some of these countries. It is an occasion when Buddhists go to the temple to perform merit-making activities, such as alms giving, meditation and listening to teachings. It has been proposed in Thailand as a more spiritual alternative to the celebration of Valentine's Day.",
            "HIS":"Little is known on how traditional Buddhist societies celebrated this event in pre-modern times, but Māgha Pūjā was recognized and celebrated in Lan Na, Lan Xang and Northeastern Thailand. Practices of worship probably varied a lot.[25] The first known instance in modern times was during the reign of the Thai king Rama IV (1804–68) who instituted it as a ceremony in 1851.[26] He reasoned that the Māgha Pūjā ... was an important gathering, a miracle in Buddhism. Wise and knowledgeable people have therefore used this opportunity to honour the Buddha and the 1,250 arahants, which is a foundation of faith and a sense of urgency. He first held it in Temple of the Emerald Buddha, in the palace only. In the evening, 31 monks from the temples Wat Bowonniwet Vihara and Wat Ratchapradit would recite the Ovādapātimokkha, lit lanterns around the ubosot (ordination hall), and give a sermon about the same Ovādapātimokkha in the Pāli and Thai languages. The King or his representative would join the yearly ceremony.[28] A recitation text used for this occasion is attributed to Rama IV.[12] As part of an enduring effort to centralize and regularize Thai Buddhism, Rama IV's successor Rama V (1853–1910) expanded the practice and organized it as a national celebration in the Temple of the Emerald Buddha.[29] In 1913, he officially established it as a public holiday,[30] as he started to organize the ceremonies in other places than the palace.[27] By 1937, the ceremony was widely held and observed in Thailand, but by 1957, it had fallen out of usage. Supreme Patriarch-to-be Plod Kittisobhano [th] helped to revive it.[31] From Thailand, the practice spread to neighboring countries which have a majority of Theravāda Buddhists."
        }
    },
    {
        "id": 30,
        "title":"Bloemencorso Bollenstreek festival",
        "img":"/images/dust.jpg",
        "DM":"Bloemencorso Bollenstreek is one of the flower parades in the Netherlands and one of the largest editions of the world. The event,..",
        "Detail":
        {   
            "ED":3,
            "id":1,
            "time":"",
            "DS":"Bloemencorso Bollenstreek is one of the flower parades in the Netherlands and one of the largest editions of the world. The event takes place in the end of April, The route starts on Saturday in Noordwijk and ends in the city of Haarlem the day after.,..",
            "HIS":"The origins of this event took place in the end of the 1940s, just after World War II. When the World War was over the need for parties and socializing was great. Organizing parades began. The procession consisted then of a couple with flower garlands and flower lingers, decorated trucks and handcarts. The local band preceded.The first flower parade of the bulb region dates back to the year 1947, while it was Willem Warmenhoven, an amaryllis grower from Hillegom, who was the creator of the first adult float in the shape of a whale. On a rickety form a small truck was built and were concealed hyacinths. Hillegom invited Sassenheim and Lisse to cooperate this event, this was set at a large-scale parade and a small corsocomité. The spring parade is closely linked to the spring flower exhibition Keukenhof."
        }
    },
    {
        "id": 31,
        "title":"festival Hoa Đà Lạt",
        "img":"/images/festival.jpg",
        "DM":"The ninth Da Lat Flower Festival will be held in the Central Highlands province of Lam Dong from November to late December, with ,,..",
        "Detail":
        {   
            "ED":3,
            "id":3,
            "time":"",
            "DS":"",
            "HIS":"The ninth Da Lat Flower Festival will be held in the Central Highlands province of Lam Dong from November to late December, with 51 attractive events, according to a plan recently announced by the provincial People’s Committee.The biennial cultural-tourism festival aims to honour the value of flowers and floriculture in the Central Highland resort city, and promote tourism and trade, and call for greater domestic and international cooperation and investment throughout the locality.It will continue to promote the brand of Da Lat as the country’s Flower Festival City, as well as introducing the city’s culture and people to visitors.The festival will include 10 main programmes and 41 sidelines activities, including the finale round of Miss Earth Vietnam 2022 pageant.Along with hosting traditional art flower spaces, organisers will arrange a wide range of activities during the festival, including a helicopter tour of Da Lat city, a youth music programme, a hot-air balloon festival, and street carnivals with the participation of international dancers.National trade fairs and a football tournament will also be held on this occasion.Starting in 2003, each of Da Lat Flower Festival edition lasts only a few days. In 2021, the 9th edition was delayed due to complicated developments of the COVID-19 pandemic."
        }
    },
    {
        "id": 32,
        "title":"The Skagit Valley Tulip Festival",
        "img":"/images/Tulips.jpg",
        "DM":"The Skagit Valley Tulip Festival is a tulip festival in the Skagit Valley of Washington state, United States. It is held annually in the spring,..",
        "Detail":
        {   
            "ED":3,
            "id":4,
            "time":"",
            "DS":"The Skagit Valley Tulip Festival is a tulip festival in the Skagit Valley of Washington state, United States. It is held annually in the spring, April 1 to April 30.",
            "HIS":"Around 1883, George Gibbs, an immigrant from England, moved to Orcas Island, where he began to grow apples and hazelnuts. Nine years later, he purchased five dollars' worth of flower bulbs to grow, and when he dug them up a couple years later and saw how they had multiplied, realized the potential for bulb-growing in the Puget Sound region. He contacted Dutch growers in Holland to learn about the business, only to find the Dutch to be highly secretive about their commercial practices. However, when he shipped off a few a bulbs to Holland, the impressed Dutch growers traveled to Orcas Island to see for themselves how tulips could grow outside Holland.In 1899, Gibbs wrote to the United States Department of Agriculture regarding the commercial prospects of bulb-growing in the region, and they took interest. In 1905, they sent Gibbs 15,000 imported bulbs from Holland to grow as an experiment, under a contract. The experiment was so successful that the United States Department of Agriculture established its own 10-acre test garden in 1908 around Bellingham, which proved successful enough for the Bellingham Tulip Festival to begin in 1920 to showcase and celebrate the success of the bulb industry.The Bellingham Tulip Festival was discontinued in 1930, due to the Great Depression and bulb freezes in 1916, 1925, and 1929 that brought heavy losses to the growers. Subsequently, the growers moved south into Skagit County.In 1946, William Roozen arrived in the United States, leaving behind a successful bulb-growing business spanning six generations in Holland. After working on several different farms, Roozen started his own in Skagit County in 1950. In 1955, he purchased the Washington Bulb Company, making him the leader among the four flower-growing families in the area, and making the Washington Bulb Company the leading grower of tulip, daffodil, and iris bulbs in North America.[3] The farm operates a public display garden and gift shop called Roozengaarde,[4] which, alongside the DeGoede family's Tulip Town, is a major attraction during the Tulip Festival.Local tulip growers showcased their bulbs through display gardens for decades prior to the formation of an official festival. The Mount Vernon Chamber of Commerce established the Skagit Valley Tulip Festival as a three-day event in 1984 to add festivities during the bloom month.[6] The event has since grown to a month-long event and coincides with street fairs, art shows and sporting events.The 2020 festival was cancelled on March 25 due to the coronavirus pandemic, which had affected Skagit County.[8] Festival organizers had initially planned for a smaller event with limited numbers of people allowed at display gardens and later car-only tours, but cancelled after the state government issued a stay-at-home order.[9] Tulip Town, a major festival venue, announced plans to use virtual tours and flower donations for hospital workers to recoup their lost revenue.[10] Several tulip fields were prematurely cut to prevent people from visiting the area."
        }
    },
    {
        "id": 33,
        "title":"Biltmore Blooms festival",
        "img":"/images/blo.jpg",
        "DM":"Welcome spring in high style at Biltmore with more than 100,000 flowers blooming in gardens fit for a Vanderbilt. At Biltmore Blooms,..",
        "Detail":
        {   
            "ED":3,
            "id":1,
            "time":"Biltmore Blooms 2023: April 1 – May 25, 2023",
            "DS":"",
            "HIS":"Welcome spring in high style at Biltmore with more than 100,000 flowers blooming in gardens fit for a Vanderbilt. At Biltmore Blooms, the estate's annual festival of flowers, the color and fragrance of orchids and thousands of spring bulbs steal the show. New for Blooms this year from May to July, linger a bit longer on Friday evenings—the gardens will be open later for enjoying sunset strolls among the blossoms.When George Vanderbilt decided to build his 250-room family home in the mountains of Western North Carolina, he hired renowned landscape architect Frederick Law Olmsted (also known for his role in designing New York's Central Park) to help his estate make a statement. Biltmore Blooms celebrates the natural progression of blooms dictated by Mother Nature and arranged by Olmsted and by the estate's current team of expert gardeners and horticulturists.Visitors to the estate can experience nearly 1,000 orchids in full bloom, showing off their tropical colors and exotic look. Check out the Conservatory to see a wide variety of species, but also take a look inside Biltmore House.Biltmore is bringing a brand-new immersive experience to Asheville in 2023. Italian Renaissance Alive invites guests to enjoy one of history's greatest artistic periods through stories of famous artists and their artworks. Visitors will encounter large-scale projections with 360-degree views set to a powerful musical score featuring Michelangelo, Da Vinci, Raphael, Botticelli and more. The exhibit launches March 3 and continues to January 7, 2024"
        }
    },
    {
        "id": 34,
        "title":"Halloween festival",
        "img":"/images/Halloween.jpg",
        "DM":"Halloween or Hallowe'en (less commonly known as Allhalloween, All Hallows' Eve, or All Saints' Eve) is a celebration observed in many ,..",
        "Detail":
        {   
            "ED":5,
            "id":2,
            "time":"October 31 every year",
            "DS":"Halloween or Hallowe'en (less commonly known as Allhalloween,[5] All Hallows' Eve,[6] or All Saints' Eve)[7] is a celebration observed in many countries on 31 October, the eve of the Western Christian feast of All Saints' Day. It begins the observance of Allhallowtide,[8] the time in the liturgical year dedicated to remembering the dead, including saints (hallows), martyrs, and all the faithful departed.One theory holds that many Halloween traditions were influenced by Celtic harvest festivals, particularly the Gaelic festival Samhain, which are believed to have pagan roots.[13][14][15][16] Some go further and suggest that Samhain may have been Christianized as All Hallow's Day, along with its eve, by the early Church.[17] Other academics believe Halloween began solely as a Christian holiday, being the vigil of All Hallow's Day.[18][19][20][21] Celebrated in Ireland and Scotland for centuries, Irish and Scottish immigrants took many Halloween customs to North America in the 19th century,[22][23] and then through American influence Halloween had spread to other countries by the late 20th and early 21st century.Popular Halloween activities include trick-or-treating (or the related guising and souling), attending Halloween costume parties, carving pumpkins or turnips into jack-o'-lanterns, lighting bonfires, apple bobbing, divination games, playing pranks, visiting haunted attractions, telling scary stories, and watching horror or Halloween-themed films.[26] Some people practice the Christian religious observances of All Hallows' Eve, including attending church services and lighting candles on the graves of the dead,[27][28][29] although it is a secular celebration for others.[30][31][32] Some Christians historically abstained from meat on All Hallows' Eve, a tradition reflected in the eating of certain vegetarian foods on this vigil day, including apples, potato pancakes, and soul cakes.",
            "HIS":"Halloween is thought to have influences from Christian beliefs and practices.[44][45] The English word 'Halloween' comes from All Hallows' Eve, being the evening before the Christian holy days of All Hallows' Day (All Saints' Day) on 1 November and All Souls' Day on 2 November.[46] Since the time of the early Church,[47] major feasts in Christianity (such as Christmas, Easter and Pentecost) had vigils that began the night before, as did the feast of All Hallows'.[48][44] These three days are collectively called Allhallowtide and are a time when Western Christians honour all saints and pray for recently departed souls who have yet to reach Heaven. Commemorations of all saints and martyrs were held by several churches on various dates, mostly in springtime.[49] In 4th-century Roman Edessa it was held on 13 May, and on 13 May 609, Pope Boniface IV re-dedicated the Pantheon in Rome to St Mary and all martyrs.[50] This was the date of Lemuria, an ancient Roman festival of the deadIn the 8th century, Pope Gregory III (731–741) founded an oratory in St Peter's for the relics of the holy apostles and of all saints, martyrs and confessors. Some sources say it was dedicated on 1 November,[53] while others say it was on Palm Sunday in April 732.[54][55] By 800, there is evidence that churches in Ireland[56] and Northumbria were holding a feast commemorating all saints on 1 November.[57] Alcuin of Northumbria, a member of Charlemagne's court, may then have introduced this 1 November date in the Frankish Empire.[58] In 835, it became the official date in the Frankish Empire.[57] Some suggest this was due to Celtic influence, while others suggest it was a Germanic idea,[57] although it is claimed that both Germanic and Celtic-speaking peoples commemorated the dead at the beginning of winter.[59] They may have seen it as the most fitting time to do so, as it is a time of 'dying' in nature.[57][59] It is also suggested the change was made on the practical grounds that Rome in summer could not accommodate the great number of pilgrims who flocked to it, and perhaps because of public health concerns over Roman Fever, which claimed a number of lives during Rome's sultry summers.By the end of the 12th century, the celebration had become known as the holy days of obligation in Western Christianity and involved such traditions as ringing church bells for souls in purgatory. It was also customary for criers dressed in black to parade the streets, ringing a bell of mournful sound and calling on all good Christians to remember the poor souls.The Allhallowtide custom of baking and sharing soul cakes for all christened souls,[63] has been suggested as the origin of trick-or-treating.[64] The custom dates back at least as far as the 15th century[65] and was found in parts of England, Wales, Flanders, Bavaria and Austria.[66] Groups of poor people, often children, would go door-to-door during Allhallowtide, collecting soul cakes, in exchange for praying for the dead, especially the souls of the givers' friends and relatives. This was called souling.Soul cakes were also offered for the souls themselves to eat,or the 'soulers' would act as their representatives.[69] As with the Lenten tradition of hot cross buns, soul cakes were often marked with a cross, indicating they were baked as alms.[70] Shakespeare mentions souling in his comedy The Two Gentlemen of Verona (1593).[71] While souling, Christians would carry lanterns made of hollowed-out turnips, which could have originally represented souls of the dead;[72][73] jack-o'-lanterns were used to ward off evil spirits.[74][75] On All Saints' and All Souls' Day during the 19th century, candles were lit in homes in Ireland,[76] Flanders, Bavaria, and in Tyrol, where they were called soul lights,that served to guide the souls back to visit their earthly homes In many of these places, candles were also lit at graves on All Souls' Day.[77] In Brittany, libations of milk were poured on the graves of kinfolk,[66] or food would be left overnight on the dinner table for the returning souls;[77] a custom also found in Tyrol and parts of Italy."
        }
    },
    {
        "id": 35,
        "title":"tomorrowland festival",
        "img":"/images/tomo.jpg",
        "DM":"Tomorrowland is a large-scale annual electronic dance music festival held in Boom, Belgium. Taking place within De Schorre provincial recreational park,it debuted in 2005, from ,..",
        "Detail":
        {   
            "ED":4,
            "id":3,
            "time":"",
            "DS":"Tomorrowland is a large-scale annual electronic dance music festival held in Boom, Belgium. Taking place within De Schorre provincial recreational park, it debuted in 2005, from an idea conceived by brothers Manu and Michiel Beers. Since then, Tomorrowland has become one of the best known music festivals in the world. It has won numerous accolades and awards, including being voted five times in a row as best musical event of the year at the International Dance Music Awards. It employs 80 people year-round for the organisation and 15,000 people during the event.",
            "HIS":"Historyhe first edition of the festival took place on 15 August 2005. Manu Beers, Michiel Beers and ID&T organized the festival. Performers included Push (M.I.K.E.), Armin van Buuren, Cor Fijneman, Yves Deruyter, Technoboy, Yoji Biomehanika and Coone.The second festival, on 30 July 2006, hosted Armin van Buuren, Axwell, Marco Bailey, Fred Baker, David Guetta, Ruthless and DJ Zany. The DJ and producer Paul Oakenfold was also announced on the poster, but canceled at the last moment, as he was on tour with Madonna at the time. Emjay, the producer of Stimulate, the anthem of 2006, performed on the main stage with The Atari Babies.On 17 March 2021, Tomorrowland announced it would delay the return of the festival until the final weekend of August and the first weekend of September. The move was an attempt to make the festival more secure in light of declining COVID-19 infection rates and the vaccination programme. The move would have seen the festival occur five weeks later than its usual dates at the end of July.[49] In April, Tomorrowland announced that a second edition of Tomorrowland Around the World would take place during the traditional July dates.Despite Belgium planning to allow large-scale outdoor events with up to 75,000 people starting from 13 August 2021, on 17 June, the mayors of Boom and Rumst jointly announced that they would deny permission for Tomorrowland to be held, citing international travel concerns and the Delta variant.[51][52] On 23 June, the festival was therefore cancelled for a second time.In December 2021, Tomorrowland announced that the festival would expand once from two to three weekends in 2022, taking place on 15–17 July, 22–24 July, and 29–31 July.[54] The theme was The Reflection of Love The festival welcomed 900,000 visitors from 200 countries.The festival took place during two weekends, 21-23 and 28–30 July. About more than 600 DJs performed on 14 different stages.The July line-up was announced on 28 January 2023, during the special digital event Adscendo - A Digital Introduction, an exclusive livestream for all pre-registered people. The digital livestream event featured 30–60 minutes performances from R3HAB, Afrojack, Armin van Buuren, W&W, Amelie Lens, Ape Rave Club, Like Mike, Dom Dolla, Kölsch, Sunnery James & Ryan Marciano, Amber Broos, James Hype, Tale Of Us or Mandy."
        }
    },
    {
        "id": 36,
        "title":"Ultra Music Festival",
        "img":"/images/wp.jpg",
        "DM":"Ultra Music Festival (UMF) is an annual outdoor electronic music festival that takes place during March in Miami, Florida, United States. The festival ,..",
        "Detail":
        {   
            "ED":4,
            "id":4,
            "time":"",
            "DS":"Ultra Music Festival (UMF) is an annual outdoor electronic music festival that takes place during March in Miami, Florida, United States.[1] The festival was founded in 1999 by Russell Faibisch and Alex Omes.It was first held on Miami Beach, but besides a tenure at Bicentennial Park, and briefly being held at Virginia Key in 2019, it has primarily been held at Bayfront Park in downtown Miami. It was a two-day festival from 1998 to 2006.Since 2011, Ultra has taken place across three days (Friday through Sunday) during the month of March.[4] In 2012, it had a record attendance, of 155,000 people at the Ultra Main Stage.[5] In 2013, the festival took place across two consecutive weekends to celebrate its 15th anniversary, with a combined attendance of 330,000 people.[6] In 2014, the festival returned to its original single-weekend format, selling out pre-sale tickets in under five minutes.[7][8] The city of Miami has estimated that since 2012, Ultra has generated approximately $995 million of economic impact, with $168 million in 2018 alone.[9] The festival was suspended in 2020 and 2021 due to the COVID-19 pandemic but resumed in 2022.The festival is held alongside the Winter Music Conference—an event focusing on the electronic music industry (which was acquired by Ultra outright in 2018), and Miami Music Week—a larger program of electronic music concerts and parties held across the region, with both events usually leading into Ultra.Although they share names, Ultra Music Festival was not directly tied to Ultra Records, an electronic music record label. However, the two entities did announce a global alliance in August 2012, which would allow them to collaborate on marketing and cross-promotion.Alongside the flagship event in Miami, Ultra has spawned a larger series of international franchises under the blanket branding Ultra Worldwide, which have included locations such as Croatia, South Africa, South Korea, Singapore, Mexico, Brazil, Colombia, and others.",
            "HIS":"Ultra Music Festival was inaugurated and produced in 1999 by business partners Russell Faibisch, Ray Navarro and Alex Omes.[14] The first festival was held as a one-day event on March 13, 1999.[15] Artists at Ultra's first festival included Paul van Dyk, Rabbit in the Moon, Josh Wink, and DJ Baby Anne.[16][17] The first Ultra Beach Music Festival, which was held at Collins Park in Miami Beach proved popular, with an estimated ten thousand concertgoers in attendance.[17] However, Faibisch and Omes still saw a financial loss of between $10,000 to $20,000 during the festival's inaugural yearHowever, in March 2000 the festival returned to South Beach's Collins Park and was met with even more success. The festival was immediately renewed for a third year.Due to the massive rise in attendance between 1999 and 2000, festival organizers decided to relocate to Bayfront Park in Downtown Miami for Ultra's third annual event in 2001.[19] Ultra Music Festival continued to bring the biggest names in electronic dance music to Miami with performances by Robin Fox, Tiësto, DJ Eddie G Miami, Armin van Buuren, EC Twins, Paul van Dyk, Paul Oakenfold, Ferry Corsten,Sander Kleinenberg, Photek, Josh Wink, DJ Craze, Pete Tong, Erick Morillo, and Rabbit in the Moon from 2001 to 2005.[20][21][22] In 2005, Fabisch met with Adam Russakoff, who has since been the executive producer, director of business affairs, and talent buyer for Ultra Music Festival and Ultra Worldwide.[23] 2005 was also the year that Carl Cox and Ultra worked together to curate the Carl Cox and Friends Arena, formerly known as the Carl Cox Global Arena, which has been a mainstay at Ultra Music Festival ever since.[24][25] With the record-breaking attendance of the seventh annual Ultra Music Festival in 2005, the festival was again relocated to another venue, Bicentennial Park, for 2006.[26][27] In 2007, the festival held its first two-day event at Bicentennial Park with more than 50,000 concert goers in attendance, which was another record at the time for Ultra.[28] The festival celebrated its 10th anniversary during March 28–29, 2008 with performances by Tiësto, Underworld, Justice, Paul van Dyk, Carl Cox, Armin van Buuren, MSTRKRFT, deadmau5, Annie Mac, Eric Prydz, Ferry Corsten, Calvin Harris, Moby, Eddie G Miami, The Crystal Method, Boys Noize, Benny Benassi, Armand van Helden, The Bravery, David Guetta, and many more."
        }
    },
    {
        "id": 37,
        "title":"Coachella festival",
        "img":"/images/coachella.jpg",
        "DM":"Coachella (officially called Coachella Valley Music and Arts Festival, and sometimes known as Coachella Festival) is an annual music and ,..",
        "Detail":
        {   
            "ED":4,
            "id":1,
            "time":"",
            "DS":"Coachella (officially called Coachella Valley Music and Arts Festival, and sometimes known as Coachella Festival) is an annual music and arts festival held at the Empire Polo Club in Indio, California, in the Coachella Valley in the Colorado DesertIt was co-founded by Paul Tollett and Rick Van Santen in 1999, and is organized by Goldenvoice, a subsidiary of AEG Presents.[2] The event features musical artists from many genres of music, including rock, pop, indie, hip hop and electronic dance music, as well as art installations and sculptures. Across the grounds, several stages continuously host live music.The festival's origins trace back to a 1993 concert that Pearl Jam performed at the Empire Polo Club while boycotting venues controlled by Ticketmaster. The show validated the site's viability for hosting large events, leading to the inaugural Coachella Festival being held over the course of two days in October 1999, three months after Woodstock '99. After no event was held in 2000, Coachella returned on an annual basis beginning in April 2001 as a single-day event. In 2002, the festival reverted to a two-day format. Coachella was expanded to a third day in 2007 and eventually a second weekend in 2012; it is now held on consecutive three-day weekends in April, with the same lineup each weekend. Organizers began permitting spectators to camp on the grounds in 2003, one of several expansions and additions in the festival's history. The festival was not held in 2020 and 2021 due to the COVID-19 pandemic.Coachella showcases popular and established musical artists as well as emerging artists and reunited groups. It is one of the largest, most famous, and most profitable music festivals in the United States and the world.[4][5] Each Coachella staged from 2013 to 2015 set new records for festival attendance and gross revenues. The 2017 festival was attended by 250,000 people and grossed $114.6 million. Coachella's success led to Goldenvoice establishing additional music festivals at the site, including the annual Stagecoach country music festival beginning in 2007, the Big 4 thrash metal festival in 2011, and the classic rock-oriented Desert Trip in 2016.",
            "HIS":"On November 5, 1993, Pearl Jam performed for almost 25,000 fans at the Empire Polo Club in Indio, California.[7] The site was selected because the band refused to play in Los Angeles as a result of a dispute with Ticketmaster over service charges applied to ticket purchases.[8][9] The show established the polo club's suitability for large-scale events; Paul Tollett, whose concert promotion company Goldenvoice booked the venue for Pearl Jam, said the concert sowed the seeds for an eventual music festival there.Around 1997, Goldenvoice was struggling to book concerts against larger companies, and they were unable to offer guarantees as high as their competitors, such as SFX Entertainment. Tollett said, We were getting our ass kicked financially. We were losing a lot of bands. And we couldn't compete with the money. As a result, the idea of a music festival was conceived, and Tollett began to brainstorm ideas for one with multiple venues. His intent was to book trendy artists who were not necessarily chart successes: Maybe if you put a bunch of them together, that might be a magnet for a lot of people. While attending the 1997 Glastonbury Festival, Tollett handed out pamphlets to artists and talent managers that featured pictures of the Empire Polo Club and pitched a possible festival there. In contrast to the frequently muddy conditions at Glastonbury caused by rain, he recalled, We had this pamphlet... showing sunny Coachella. Everyone was laughing.After scouting several sites for their festival,[6] Tollett and Goldenvoice co-president Rick Van Santen returned to the Empire Polo Club during the Big Gig festival in 1998. Impressed by the location's suitability for a festival, they decided to book their event there.[8] The promoters had hoped to stage their inaugural festival in 1998 but were unable to until the following year.[9] On July 16, 1999, Goldenvoice announced that the Indio City Council had approved the festival and would provide $90,000 for services such as traffic control and public safety. The funds came with a guarantee of repayment from the promoter, as the city was keen to avoid incurring another loss; the previous year's Big Gig festival cost Indio $16,000 due to last-minute changes to the lineup and poor attendance.[11] The Coachella Valley Music and Arts Festival was officially announced on July 28 with a preliminary lineup of 40 acts;[12] tickets went on sale on August 7.Coachella's announcement came just one week after the conclusion of Woodstock '99, a festival in July 1999 that was marred by looting, arson, violence, and rapes. Goldenvoice's insurance costs increased 40% as a result and the company faced uncertainty regarding Coachella's tickets.[9][14] Organizers were already aiming to provide a high-comfort festival experience Coachella but rededicated themselves to those efforts after Woodstock '99. Advertisements boasted free water fountains, ample restrooms, and misting tents.[14] Retrospectively, Tollett called the decision to announce a new festival just two months prior to staging it financial suicide"
        }
    },
    {
        "id": 38,
        "title":"Primavera Sound festival",
        "img":"/images/prima.jpg",
        "DM":"Primavera Sound (commonly referred to as simply Primavera) is an annual music festival held at the Parc del Fòrum in Barcelona, Spain ,..",
        "Detail":
        {   
            "ED":4,
            "id":2,
            "time":"",
            "DS":"Primavera Sound (commonly referred to as simply Primavera) is an annual music festival held at the Parc del Fòrum in Barcelona, Spain during late May and early June. It was founded in 2001 by Pablo Soler as a showcase for Spanish noise bands, originally held at the Poble Espanyol before moving to the Parc del Fòrum, a much larger site on the seafront, in 2005.[4] It is one of the largest and most-attended music festivals in Europe and the biggest in the MediterraneanThe festival's image was originally oriented around indie rock, but in recent years has seen a larger presence of genres such as hip hop, electronic dance music and pop.[6][7] In contrast to most other European festivals, traditionally the first bands go on at 4:00 pm, the headliners begin at midnight, and the latest acts play until 6:00 a.m.Originally a one-day event, a second day was added beginning in 2002, and the 2004 edition became the first to feature a three-day lineup. In 2008, the festival began hosting free shows for ticketholders in local venues across Barcelona, beginning a tradition now known as Primavera a la Ciutat.[10] No festival was held in 2020 and 2021 due to the COVID-19 pandemic. It returned in 2022 with a two-week format for the first time, combining most bookings from the missed years, before reverting to a one-week event in 2023.The success of the festival led to an international expansion to Porto in 2012 at the Parque da Cidade, which takes place a week after the main edition.[11] In 2022, the festival hosted its first editions in Los Angeles, Santiago de Chile, Buenos Aires and São Paulo",
            "HIS":"The name Primavera Sound had been in use for shows throughout Spain for local noise bands since the 1990s, but founder Pablo Soler was able to take the name back for a festival that he began planning in 2000. The first edition was held on 28 April 2001 at the Poble Espanyol, an open-air architectural museum on top of the Montjuïc hill.[21] It featured four stages and 19 acts including Armand van Helden, Carl Craig, Los Planetas, Unkle and Yasuharu Konishi, the former frontman of Japanese band Pizzicato 5.[22] Soler said he wanted to start the festival as a showcase for Spanish noise bands. The festival differed from most of its other European counterparts like Glastonbury by being held within a city rather than in a large camping site.Primavera Sound expanded to a second day in 2002, which took place on 17 and 18 May. The headliners were Pulp, Tindersticks and Spiritualized. Other prominent performers included Aphex Twin, Camera Obscura, Cat Power, Echo & the Bunnymen, J Mascis and The Moldy Peaches, whose set was their only concert in Spain for the next 21 years.In 2003, attendance improved to 24,200, and the number of acts also increased to more than 90 groups and DJs, both local and international. Five areas were arranged at the Poble Espanyol site for the night shows (Nitsa-Apolo, Rockdelux by Lois, CD Drome, Nasti and Psicolabis). An extra site was added to the festival: Mercat de les Flors, for the day time activities: the Primavera Soundtrack Film Festival and the Record label Fair, which included two stages (acoustic and electric) where the label's bands showcased their works. The headliners were Belle and Sebastian, Mogwai, Sonic Youth and Television; the lineup also featured Arab Strap, El-P, The Folk Implosion, The Go-Betweens, Julian Cope, Teenage Fanclub, The White Stripes and Yo La Tengo, among others."
        }
    },
    {
        "id": 39,
        "title":"Hay Festival",
        "img":"/images/Hay.jpg",
        "DM":"The Hay Festival of Literature & Arts, better known as the Hay Festival (Welsh: Gŵyl Y Gelli), is an annual literature festival held in Hay-on-Wye, Powys, Wales,,..",
        "Detail":
        {   
            "ED":5,
            "id":3,
            "time":"",
            "DS":"The Hay Festival of Literature & Arts, better known as the Hay Festival (Welsh: Gŵyl Y Gelli), is an annual literature festival held in Hay-on-Wye, Powys, Wales, for 10 days from May to June. Devised by Norman, Rhoda and Peter Florence in 1988, the festival was described by Bill Clinton in 2001 as The Woodstock of the mind. Tony Benn said: In my mind it's replaced ChristmasIt has become a prominent festival in British culture, and sessions at the festival have been recorded for television and radio programmes such as The Readers' and Writers' Roadshow and The One Show. All the BBC's national radio channels apart from Radio One have been involved in broadcasting from the festival, and Sky Arts showed highlights of the festival from 2010 until 2013, handing over the main coverage to the BBC for the 2014 event.",
            "HIS":"The festival was founded in 1988 by Peter Florence and his parents Rhoda and Norman.[4] Hay-on-Wye was already well known for its many bookshops before the festival was launched. Richard Booth opened his first shop there in 1962, and by the 1970s Hay had gained the nickname The Town of Books.From its inception, the festival was held at a variety of venues around Hay, including the local primary school, until 2005 when it moved to a unified location just south of the town.The Guardian was the main sponsor of the festival from 2002 to 2010, succeeding The Sunday Times. The Daily Telegraph and its associated brands in Telegraph Media Group had two terms as three-year sponsors, starting with the 2011 festival.[7] From 2017, the Tata Group and Baillie Gifford are among the principal sponsors, along with the BBC and many non-media companies such as the Arts Council of Wales and the British Council.Cristina Fuentes La Roche has been the International Director at Hay Festival since 2005.The festival has expanded over the years to include musical performances and film previews. A children's festival, Hay Fever, runs alongside the main festival. It has also expanded internationally and sister festivals take place in Aarhus, Arequipa, Nairobi, Dhaka, Zacatecas, the Maldives, Kerala at Thiruvananthapuram, Beirut, Belfast, Cartagena, the Alhambra Palace, Parc Prison in Bridgend and Segovia. In 2009 Hay Festival also took on the ailing Brecon Jazz Festival. It is run by a not-for-profit company, and entrance is free to everyoneThe 2012 festival included writers Martin Amis, Jung Chang, Louis de Bernières, Mark Haddon, Mario Vargas Llosa, Hilary Mantel, Ian McEwan, Michael Morpurgo, Ben Okri, Ian Rankin, Salman Rushdie, Owen Sheers, Jeanette Winterson, comedians Bill Bailey, Rob Brydon, Julian Clary, Jack Dee, Tim Minchin, politicians Peter Hain and Boris Johnson, scientists John D. Barrow, Martin Rees, Simon Singh, and general speakers Harry Belafonte, William Dalrymple, Stephen Fry, A. C. Grayling, Germaine Greer, Michael Ignatieff, and David StarkeyIn late July 2021, co-founder and director Peter Florence resigned following an independent investigation that upheld a complaint of bullying against him. Florence had been suspended in October 2020.[11][12] He commented: I consider that my role had become untenable due to the conduct of the board and its insistence on holding a disciplinary hearing in my absence whilst I was off sick after a breakdown."
        }
    },
    {
        "id": 40,
        "title":"Huế festival",
        "img":"/images/hue1.jpg",
        "DM":"If you are a Hue lover or just a normal tourist who has fallen in love with Hue’s ancient city, you may know or even have heard about Hue Festival,..",
        "Detail":
        {   
            "ED":5,
            "id":4,
            "time":"",
            "DS":"If you are a Hue lover or just a normal tourist who has fallen in love with Hue’s ancient city, you may know or even have heard about Hue Festival in Vietnam once in your life. Every two years, Hue city will celebrate  Festival Hue once to preserve traditional and cultural values in the Hue citadelWhen you join this outstanding event, you will have a chance to enjoy a ton of art activities, street performances, and so on. Today’s article would like to show you the latest information about Hue Festival 2023. Let’s take a look!",
            "HIS":"Originating from Hue – France Festival 1992 between Hue and Viet-France Codev, the special holiday was celebrated for the first time. Till 1998, the government allowed celebrating it with another name: Hue Festival – in 2002. From that day, the federal has decided to celebrate Hue Festival Vietnam on a larger scale and higher quality with the theme: “Cultural Heritage: Integration and Development”.This is the first festival in Vietnam following the standard international event compared to other big cities in the world. With more than 10 times celebrated such as Hue Festival 2022, Hue Festival 2021, etc, it has still maintained its location on an international scale inside and outside the country."
        }
    },
    {
        "id": 41,
        "title":"Moonrise festival",
        "img":"/images/Lunar.jpg",
        "DM":"Moonrise Festival is an annual electronic dance music (EDM) festival held in Baltimore, Maryland. In 2013, the festival was scheduled to be held on June 8 and 9 in Port ,...",
        "Detail":
        {   
            "ED":4,
            "id":1,
            "time":"",
            "DS":"Moonrise Festival is an annual electronic dance music (EDM) festival held in Baltimore, Maryland. In 2013, the festival was scheduled to be held on June 8 and 9 in Port Covington. However, the festival was cancelled due to event organizers failing to get the necessary city permits.[1] In 2014, the festival was held at Pimlico Race Course and was considered an outstanding success with over 30,000 in attendance.[2] The 2015 and 2016 festival were held at the same location on August 8–9, and 6-7 respectively with headliners such as Bassnectar, The Chainsmokers, Zedd, and Tiësto. ",
            "HIS":"The 2017 festival returned to Pimlico on August 12–13 with headliners Zeds Dead, Pretty Lights, Carnage, and Dillstradamus. [3] The 2018 edition of the festival took place on August 11–12 with the headliners list including the likes of Marshmello, Diplo, and Cashmere Cat. The festival returned to the same location on August 10–11, 2019, headlined by Illenium, Excision, and Tiësto. In 2020 Moonrise announced a move to a 3-day festival. But the COVID-19 pandemic ended up canceling both the 2020 and 2021 occurrences. Moonrise announced a returned to Pimlico again in 2022 with no mention of an extension to 3 days as originally planned for 2020. This would be the first iteration of the festival since the Glow brand had been brought under the Insomniac parent company. On Aug 6–7, 2022 Moonrise returned with headliners including Tiesto, Zedd, and Rezz. Moonrise 2023 has been announced to return to Pimlico again Aug 12–13, 2023. VIP tier 1 ticket prices increased $50, to $275 per person vs Project Glow in DC April 29–30 or the 2022 edition of Moonrise."
        }
    },
    {
        "id": 42,
        "title":"The Taiwan Lantern festival",
        "img":"/images/Festiva.jpg",
        "DM":"The Taiwan Lantern Festival is an annual event hosted by the Tourism Bureau of the Ministry of Transportation and Communications in Taiwan,..",
        "Detail":
        {   
            "ED":5,
            "id":1,
            "time":"",
            "DS":"The Taiwan Lantern Festival is an annual event hosted by the Tourism Bureau of the Ministry of Transportation and Communications in Taiwan to celebrate the Lantern Festival.Many activities are held across Taiwan during the Lantern Festival; thousands of sky lanterns are lit over Pingxi District (平溪). In Yanshuei District, the firecrackers ceremony of the Wumiao Temple is also one of the important activities.[citation needed] The notoriously dangerous Tainan Yanshuei Fireworks Display, also known as the Yanshui Beehive Fireworks Festival, (beehive of fireworks) was originally celebrated to ward off evil and disease from the town. The Taipei Pingxi Sky Lanterns were released originally to let others know that the town was safe. These lanterns are decorated with wishes and images relating to the owner. These two events are known together as Fireworks in the South, Sky Lanterns in the North.",
            "HIS":"Starting from 1990, the Tourism Bureau integrated civilian and local governmental resources to conduct the event to celebrate the Lantern Festival (15th day of the first month in the lunar calendar) and the end of the lunar new year. The purpose of the festival is to spread the traditional folklore. It is also known as the Yuan Xiao Festival.The firecrackers ceremony of the Wumiao temple in Yanshuei District was held by ancient people, to show respect for the exploits of Guan Yu. Fengpao is the ceremony to launch thousands of soaring firecrackers, hung on a wooden stand 5–25 metres high. This ceremony starts from six o'clock in the afternoon until five o'clock in the morning. Thousands of people and visitors attend the ceremony.The festival is the most important annual lantern festival in Taiwan. Prior to 2001, the event was held at Chiang Kai-shek Memorial Park in Taipei. Since 2001, the event has toured Taiwan."
        }
    },
    {
        "id": 43,
        "title":"Sand festivals",
        "img":"/images/sands.jpg",
        "DM":"Sand festivals or festivals of sand sculpture are exhibitions of sculptures made of sand carried out in various places around the world. These events usually,..",
        "Detail":
        {   
            "ED":5,
            "id":2,
            "time":"It is a three-day art festival held in December on the weekend before Christmas with different themes to highlight a particular issue.",
            "DS":"Sand festivals or festivals of sand sculpture are exhibitions of sculptures made of sand carried out in various places around the world. These events usually include a competition.Traditional sand sculptures are sandcastles. However, at sand festivals one may see virtually any kinds of sculptures you would expect to see in stone, bronze or wood.",
            "HIS":"Indian sand artist Sudarshan Patnaik created a sculpture in memory of the victims of the tsunami disaster in Puri, south of the capital of the Indian state of Odisha, Bhubaneshwar. The determination of this man, support, and a consorted effort from his friends in Puri, culminated in the formation of the Golden Sand Art Institute 1995. The institute is an open-air institute with no boundaries and limitations. It is located on the seashore that spans between Hotel May Fair Beach Resort and the Panthanivas in Puri.Goa Sand Art Festival is an annual event hosted in Goa, in association with Goa Tourism. The ‘Goa Sand Art Festival’ is a three-day festival held at Candolim beach, which is one of the pristine beaches in Goa. It is a three-day art festival held in December on the weekend before Christmas with different themes to highlight a particular issue. The Goa Sand Art Festival conceptualized and organized by Jerry Jose is one of its kind art festivals involving the students and upcoming artists."
        }
    },

    {
        "id": 44,
        "title":"Albuquerque International Balloon Fiesta festivals",
        "img":"/images/ballon.jpg",
        "DM":"The Albuquerque International Balloon Fiesta is a yearly hot air balloon festival that takes place in Albuquerque,..",
        "Detail":
        {   
            "ED":5,
            "id":2,
            "time":"October 7 - 15-2023.",
            "DS":"The Albuquerque International Balloon Fiesta is a yearly hot air balloon festival that takes place in Albuquerque, New Mexico,during early October. The Balloon Fiesta is a nine-day event occurring in the first full week of October, and has over 500 hot air balloons each year far from its beginnings of merely 13 balloons in 1972.[1] The event is the largest balloon festival in the world, followed by the Grand Est Mondial Air in France, and the León International Balloon Festival in Mexico..",
            "HIS":"The Balloon Fiesta began in 1972 as the highlight of a 50th birthday celebration for 770 KOB Radio. Radio station manager Dick McKee asked Sid Cutter, owner of Cutter Flying Service and the first person to own a hot air balloon in New Mexico, if KOB could use his new hot-air balloon as part of the festivities. The two began discussing ballooning, along with conversation and help from Oscar Kratz, and McKee asked what the largest gathering of hot air balloons to date had been (which had been 19 balloons in England). Kratz asked Can we get 19 here? Cutter agreed to try. He got commitments from 21 pilots, but bad weather kept some of them from arriving in time. The first fiesta ended up as a gathering of 13 balloons on April 8, 1972, sponsored by KOB. The first event was located in the parking lot of the Coronado Center Shopping Mall with 20,000 spectators and with balloonists from Arizona, California, Iowa, Michigan, Minnesota, Nevada and Texas taking part. McKee, Cutter, and Kratz are the three men who had originally started the balloon races.[3] The first fiesta incorporated a Roadrunner-Coyote Balloon Race with 1 balloon being the Roadrunner and the others being Coyote balloons (the Roadrunner balloon was actually emblazoned with likenesses of both Warner Bros. characters). The winner of the race - the Coyote that landed closest to the Roadrunner - was Don Piccard, flying a balloon of his company's design and construction (his wife also placed in the race). This race has continued as part of the Balloon Fiesta today.The next year Albuquerque hosted the first World Hot-Air Balloon Championships in February and the fiesta became an international event. In 1975 Albuquerque was looking at hosting the World Championships again, but the event was scheduled for October. So the fiesta was moved to correspond with the championships. To maintain interest in Albuquerque's bid to host the championships, a balloon rally was held in February of that year. Autumn being a far better flying time than February, the event has remained in early October to the present day.The Balloon Fiesta grew each year for decades, and today is the largest balloon convention in the world. The number of registered balloons reached a peak of 1,019 in 2000, prompting the Balloon Fiesta Board to limit the number to 750 starting in 2001,[4] citing a desire for quality over quantity. The limit was changed to 600 in 2009 –; citing recent growth in the city and a loss of landing zones. On any given day during the festival, up to 100,000 spectators may be on the launch field where they are provided the rare opportunity to observe inflation and take off procedures. Countless more people gather at landing sites all over the city to watch incoming balloons. The limit was increased to 1,000 in 2011."
        }
    },

    {
        "id": 45,
        "title":"The Pushkar Fair festivals",
        "img":"/images/Pushkar.jpg",
        "DM":"The Pushkar Fair, also called the Pushkar Camel Fair or locally as Kartik Mela or Pushkar ka Mela is an annual multi-day livestock fair,..",
        "Detail":
        {   
            "ED":5,
            "id":3,
            "time":"21 November, 2023 – 27 November, 2023",
            "DS":"The Pushkar Fair, also called the Pushkar Camel Fair or locally as Kartik Mela or Pushkar ka Mela is an annual multi-day livestock fair and cultural fête held in the town of Pushkar near Ajmer city in Ajmer district in (Rajasthan, India). The fair starts with the Hindu calendar month of Kartik and ends on the Kartik Purnima, which typically overlaps with late October and early November in the Gregorian calendar.[1][2] In 1998, over 1 million visitors came to Pushkar throughout the year.[2] The Pushkar fair alone attracts over 200,000 visitors..",
            "HIS":"The Pushkar fair[4] is one of India's largest camel, horse and cattle fairs. Apart from the trading of livestock, it is an important pilgrimage season for Hindus to the Pushkar lake. Pushkar fair has also become a significant tourist attraction for domestic and international travellers, given the cooler season, the abundance of colourful cultural themes.[2] Cultural events and competitions include dances, tug of war between women teams as well as men teams, the matka phod, longest moustache competition, bridal competition, camel races and others.Thousands of people go to the banks of the Pushkar Lake where the fair takes place. Men trade their livestock, which includes camels, horses, cows, sheep and goats.[8] Rural families shop at the handicraft stalls full of bracelets, clothes, textiles and fabrics. A camel race starts off the festival, with music, songs and exhibitions to follow. Between these events, the most waited for is the test of how the camel is able to bring the items. In order to demonstrate, the men go up on the group of camels one after another.Pushkar is in centre-east part of Rajasthan, on the western side of Aravalli mountains. The nearest airport from Pushkar is Kishangarh Airport in Ajmer, about 40 km (25 mi) northeast. Jaipur is well connected with all the major cities in India. Pushkar is about 10 km (6.2 mi) from Ajmer, connected via Pushkar road (Highway 58) which goes over the Aravalli Range mountains. Ajmer is also the nearest major railway STATION."
        }
    },
    {
        "id": 46,
        "title":"Olympic Games",
        "img":"/images/olym.jpg",
        "DM":"The modern Olympic Games or Olympics are the leading international sporting events featuring summer and winter sports competitions in which thousands of athletes ,..",
        "Detail":
        {   
            "id":3,
            "time":"have alternated between the Summer and Winter Olympics every two years during the four-year period",
            "DS":"The modern Olympic Games or Olympics (French: Jeux olympiques)[a][1] are the leading international sporting events featuring summer and winter sports competitions in which thousands of athletes from around the world participate in a variety of competitions. The Olympic Games are considered the world's foremost sports competition with more than 200 teams, representing sovereign states and territories participating; by default the Games generally substitute for any World Championships the year in which they take place (however, each class usually maintains their own records).[2] The Olympic Games are normally held every four years, and since 1994, have alternated between the Summer and Winter Olympics every two years during the four-year period.Their creation was inspired by the ancient Olympic Games (Ancient Greek: Ὀλυμπιακοί Ἀγῶνες), held in Olympia, Greece from the 8th century BC to the 4th century AD. Baron Pierre de Coubertin founded the International Olympic Committee (IOC) in 1894, leading to the first modern Games in Athens in 1896. The IOC is the governing body of the Olympic Movement (which encompasses all entities and individuals involved in the Olympic Games) with the Olympic Charter defining its structure and authority.The evolution of the Olympic Movement during the 20th and 21st centuries has resulted in several changes to the Olympic Games. Some of these adjustments include the creation of the Winter Olympic Games for snow and ice sports, the Paralympic Games for athletes with disabilities, the Youth Olympic Games for athletes aged 14 to 18, the five Continental games (Pan American, African, Asian, European, and Pacific), and the World Games for sports that are not contested in the Olympic Games. The IOC also endorses the Deaflympics and the Special Olympics. The IOC has needed to adapt to a variety of economic, political, and technological advancements. The abuse of amateur rules by the Eastern Bloc nations prompted the IOC to shift away from pure amateurism, as envisioned by Coubertin, to the acceptance of professional athletes participating at the Games. The growing importance of mass media has created the issue of corporate sponsorship and general commercialisation of the Games. World wars led to the cancellation of the 1916, 1940, and 1944 Olympics; large-scale boycotts during the Cold War limited participation in the 1980 and 1984 Olympics;[3] and the 2020 Olympics were postponed until 2021 as a result of the COVID-19 pandemic.The Olympic Movement consists of international sports federations (IFs), National Olympic Committees (NOCs), and organising committees for each specific Olympic Games. As the decision-making body, the IOC is responsible for choosing the host city for each Games, and organises and funds the Games according to the Olympic Charter. The IOC also determines the Olympic programme, consisting of the sports to be contested at the Games. There are several Olympic rituals and symbols, such as the Olympic flag and torch, as well as the opening and closing ceremonies. Over 14,000 athletes competed at the 2020 Summer Olympics and 2022 Winter Olympics combined, in 40 different sports and 448 events.[4][5] The first-, second-, and third-place finishers in each event receive Olympic medals: gold, silver, and bronze, respectively.The Games have grown to the point that nearly every nation is now represented; colonies and overseas territories are often allowed to field their own teams. This growth has created numerous challenges and controversies, including boycotts, doping, bribery, and terrorism. Every two years, the Olympics and its media exposure provide athletes with the chance to attain national and international fame. The Games also provide an opportunity for the host city and country to showcase themselves to the world.",
            "HIS":"The Ancient Olympic Games were religious and athletic festivals held every four years at the sanctuary of Zeus in Olympia, Greece. Competition was among representatives of several city-states and kingdoms of Ancient Greece. These Games featured mainly athletic but also combat sports such as wrestling and the pankration, horse and chariot racing events. It has been widely written that during the Games, all conflicts among the participating city-states were postponed until the Games were finished. This cessation of hostilities was known as the Olympic peace or truce.[6] This idea is a modern myth because the Greeks never suspended their wars. The truce did allow those religious pilgrims who were travelling to Olympia to pass through warring territories unmolested because they were protected by Zeus.[7]The origin of the Olympics is shrouded in mystery and legend;[8] one of the most popular myths identifies Heracles and his father Zeus as the progenitors of the Games.[9][10][11] According to legend, it was Heracles who first called the Games Olympic and established the custom of holding them every four years.[12] The myth continues that after Heracles completed his twelve labours, he built the Olympic Stadium as an honour to Zeus. Following its completion, he walked in a straight line for 200 steps and called this distance a stadion (Ancient Greek: στάδιον, Latin: stadium, stage), which later became a unit of distance. The most widely accepted inception date for the Ancient Olympics is 776 BC; this is based on inscriptions, found at Olympia, listing the winners of a footrace held every four years starting in 776 BC.[13] The Ancient Games featured running events, a pentathlon (consisting of a jumping event, discus and javelin throws, a foot race, and wrestling), boxing, wrestling, pankration, and equestrian events.[14][15] Tradition has it that Coroebus, a cook from the city of Elis, was the first Olympic champion.The Olympics were of fundamental religious importance, featuring sporting events alongside ritual sacrifices honouring both Zeus (whose famous statue by Phidias stood in his temple at Olympia) and Pelops, divine hero and mythical king of Olympia. Pelops was famous for his chariot race with King Oenomaus of Pisatis.[17] The winners of the events were admired and immortalised in poems and statues.[18] The Games were held every four years, and this period, known as an Olympiad, was used by Greeks as one of their units of time measurement. The Games were part of a cycle known as the Panhellenic Games, which included the Pythian Games, the Nemean Games, and the Isthmian Games.The Olympic Games reached the height of their success in the 6th and 5th centuries BC, but then gradually declined in importance as the Romans gained power and influence in Greece. While there is no scholarly consensus as to when the Games officially ended, the most commonly held date is 393 AD, when the emperor Theodosius I decreed that all pagan cults and practices be eliminated.[b] Another date commonly cited is 426 AD, when his successor, Theodosius II, ordered the destruction of all Greek temples.."
        }
    }

]